Repository: Al-tronic/l10n-kde-ga
Catalog: messages/katomic/katomic._desktop_.po
Languages: ga

# Name
source: Original levels
ga: Bunleibhéil

# Name
source: Water
ga: Uisce

# Name
source: Formic Acid
ga: Aigéad Formach

# Name
source: Acetic Acid
ga: Aigéad Aicéiteach

# Name
source: trans-Butene
ga: tras-Bhúitéin

# Name
source: cis-Butene
ga: cios-Bhúitéin

# Name
source: Dimethyl ether
ga: Éitear démheitil

# Name
source: Butanol
ga: Bútánól

# Name
source: 2-Methyl-2-Propanol
ga: 2-Meitil-2-Própánól

# Name
source: Glycerin
ga: Glicrín

# Name
source: Poly-Tetra-Fluoro-Ethene
ga: Polai-Teitrea-Fluara-Eitéin

# Name
source: Oxalic Acid
ga: Aigéad Ocsalach

# Name
source: Methane
ga: Meatán

# Name
source: Formaldehyde
ga: Formaildéad

# Name
source: Crystal 1
ga: Criostal 1

# Name
source: Acetic acid ethyl ester
ga: Aigéad aicéiteach eitil eistear

# Name
source: Ammonia
ga: Amóinia

# Name
source: 3-Methyl-Pentane
ga: 3-Meitil-Peantán

# Name
source: Propanal
ga: Própánal

# Name
source: Propyne
ga: Próipéín

# Name
source: Furanal
ga: Fúránál

# Name
source: Cyclo-Pentane
ga: Cioglai-Peantán

# Name
source: Methanol
ga: Meatánól

# Name
source: Nitro-Glycerin
ga: Nítriglicrín

# Name
source: Ethane
ga: Eatán

# Name
source: Crystal 2
ga: Criostal 2

# Name
source: Ethylene-Glycol
ga: Eitiléin-Gliocól

# Name
source: L-Alanine
ga: L-Alainín

# Name
source: Cyanoguanidine
ga: Cianaghuainidín

# Name
source: Prussic Acid (Cyanic Acid)
ga: Aigéad Prúiseach

# Name
source: Anthracene
ga: Antraicéin

# Name
source: Thiazole
ga: Tiasól

# Name
source: Saccharin
ga: Siúicrín

# Name
source: Ethylene
ga: Eitiléin

# Name
source: Styrene
ga: Stiréin

# Name
source: Melamine
ga: Meilimín

# Name
source: Cyclobutane
ga: Cioglabútán

# Name
source: Nicotine
ga: Nicitín

# Name
source: Acetyle salicylic acid
ga: Aigéad salaicileach aicéitileach

# Name
source: Meta-Di-Nitro-Benzene
ga: Meiti-Dé-Nitri-Beinséin

# Name
source: Malonic Acid
ga: Aigéad Malónach

# Name
source: 2,2-Dimethylpropane
ga: 2,2-Démheitilprópán

# Name
source: Ethyl-Benzene
ga: Eitil-Beinséin

# Name
source: Propene
ga: Próipéin

# Name
source: L-Asparagine
ga: L-Asparaigin

# Name
source: 1,3,5,7-Cyclooctatetraene
ga: 1,3,5,7-Cioglochtaiteitréin

# Name
source: Vanillin
ga: Fanailin

# Name
source: Crystal 3
ga: Criostal 3

# Name
source: Uric Acid
ga: Aigéad Úrach

# Name
source: Thymine
ga: Tímín

# Name
source: Aniline
ga: Anailín

# Name
source: Chloroform
ga: Clóraform

# Name
source: Carbonic acid
ga: Aigéad Carbónach

# Name
source: Crystal 4
ga: Criostal 4

# Name
source: Ethanol
ga: Eatánól

# Name
source: Acrylo-Nitril
ga: Aicrilinítríl

# Name
source: Furan
ga: Fúrán

# Name
source: l-Lactic acid
ga: Aigéad l-Lachtach

# Name
source: Maleic Acid
ga: Aigéad Mailéach

# Name
source: meso-Tartaric acid
ga: aigéad méisi-Tartarach

# Name
source: Crystal 5
ga: Criostal 5

# Name
source: Formic acid ethyl ester
ga: Aigéad formach eitil eistear

# Name
source: 1,4-Cyclohexadiene
ga: 1,4-Cioglaiheicsidhé-éin

# Name
source: Squaric acid
ga: Aigéad cearnach

# Name
source: Ascorbic acid
ga: Aigéad ascorbach

# Name
source: Isopropanol
ga: Iseaprópánól

# Name
source: Phosgene
ga: Foisgéin

# Name
source: Thiophene
ga: Tiaiféin

# Name
source: Urea
ga: Úiré

# Name
source: Pyruvic Acid
ga: Aigéad Piorúvach

# Name
source: Ethylene oxide
ga: Eitiléin Ocsaíd

# Name
source: Phosphoric Acid
ga: Aigéad Fosfarach

# Name
source: Diacetyl
ga: Dé-aicéitil

# Name
source: trans-Dichloroethene
ga: tras-Déchlóireitéin

# Name
source: Allylisothiocyanate
ga: Aillilisitiaicianáit

# Name
source: Diketene
ga: Dé-cheitéin

# Name
source: Ethanal
ga: Eatánal

# Name
source: Acroleine
ga: Acroiléin

# Name
source: Uracil
ga: Úraicil

# Name
source: Caffeine
ga: Caiféin

# Name
source: Acetone
ga: Aicéatón

# GenericName
source: Sokoban-like Logic Game
ga: Cluiche Loighce Cosúil le Sokoban
