Repository: Al-tronic/l10n-kde-ga
Catalog: messages/kapman/kapman._desktop_.po
Languages: ga

# GenericName
source: Pac-Man Clone
ga: Clón Pac-Man

# Comment
source: Eat pills escaping ghosts
ga: Ith piollairí agus éalaigh ó thaibhsí

# Name
source: Invisible
ga: Dofheicthe

# Description
source: Getting bored with Kapman? More than 100,000 points over level 20? Next step: the invisible maze!
ga: An bhfuil tú ag éirí bréan de Kapman? An bhfuil níos mó ná 100,000 pointe agat ar leibhéal 20? An chéad chéim eile: an lúbra dofheicthe!

# Name
source: Matches
ga: Cipíní

# Description
source: A matches drawn maze
ga: Lúbra déanta as cipíní

# Name
source: Mountain Adventure
ga: Eachtra sna Sléibhte

# Description
source: Default
ga: Réamhshocrú

# Name
source: Mummies Crypt
ga: Uaimh na Mumaithe

# Description
source: Avoid the mummies at all costs!
ga: Seachain na mumaithe ar ais nó ar éigean!

# Name
source: Retro
ga: Sean-Nós

# Description
source: The old game theme revisited
ga: Athfhéachaint ar an seantéama cluiche
