Repository: Al-tronic/l10n-kde-ga
Catalog: messages/konversation/konversation._desktop_.po
Languages: ga

# Comment
source: "Big Bullets" by Dario Abatianni
ga: "Big Bullets" le Dario Abatianni

# Comment
source: "Christmas Theme" by Kenichiro Takahashi
ga: "Christmas Theme" le Kenichiro Takahashi

# Name
source: Classic Theme
ga: Téama Clasaiceach

# Comment
source: "LED" by Dario Abatianni
ga: "LED" le Dario Abatianni

# Name
source: Default Theme
ga: Téama Réamhshocraithe

# Name
source: KDE 3 Default Theme
ga: Téama Réamhshocraithe KDE 3

# Comment
source: "Simplistic" by Shintaro Matsuoka
ga: "Simplistic" le Shintaro Matsuoka

# Name
source: Smiling Theme
ga: Téama "Smiling"

# Comment
source: "Smiling" stolen from Kopete by John Tapsell
ga: "Smiling", goidte ó Kopete ag John Tapsell

# Name
source: Square Theme
ga: Téama "Square"

# Comment
source: "SQUARE" by Kenichiro Takahashi
ga: "SQUARE" le Kenichiro Takahashi

# Name
source: New message
ga: Teachtaireacht nua

# Comment
source: New message arrived in a channel
ga: Tháinig teachtaireacht nua i gcainéal

# Name
source: Nick written
ga: Scríobhadh do leasainm

# Comment
source: Someone wrote your nick in a message
ga: Scríobh duine éigin do leasainm i dteachtaireacht

# Name
source: Private message
ga: Teachtaireacht phríobháideach

# Comment
source: You received a private message
ga: Fuair tú teachtaireacht phríobháideach

# Name
source: Nick changed
ga: Athraíodh leasainm

# Comment
source: Someone changed their nick
ga: D'athraigh duine éigin a leasainm

# Name
source: Incoming file
ga: Comhad isteach

# Comment
source: Someone wants to transmit a file to you over DCC
ga: Is mian le duine éigin comhad a sheoladh chugat trí DCC

# Name
source: Nick joined channel
ga: Chuaigh leasainm le cainéal

# Comment
source: New nick joined a channel
ga: Chuaigh leasainm nua le cainéal

# Name
source: Nick left channel
ga: D'fhág leasainm cainéal

# Comment
source: A nick left a channel
ga: D'fhág leasainm cainéal

# Name
source: Mode change
ga: Athrú móid

# Comment
source: A user or channel mode was changed
ga: Athraíodh mód úsáideora nó mód cainéil

# Comment
source: A user on your watched nicks list has come online
ga: Tá úsáideoir ó do liosta faire ar líne anois

# Name
source: Query
ga: Iarratas

# Comment
source: Someone started a conversation (query) with you
ga: Thosaigh duine éigin comhrá (iarratas) leat

# Name
source: Kick
ga: Ciceáil

# Comment
source: Someone kicked you out of a channel
ga: Chiceáil duine éigin thú amach as cainéal

# Name
source: Connection failure
ga: Theip ar cheangal

# Comment
source: Failed to connect to server
ga: Theip ar cheangal le freastalaí

# Name
source: You joined a channel
ga: Chuaigh tú le cainéal

# Comment
source: You joined a channel
ga: Chuaigh tú le cainéal

# Name
source: DCC Chat
ga: Comhrá DCC

# Comment
source: Someone started a DCC chat with you
ga: Thosaigh duine éigin comhrá DCC leat

# GenericName
source: IRC Client
ga: Cliant IRC
