Repository: Al-tronic/l10n-kde-ga
Catalog: messages/khotkeys/khotkeys._desktop_.po
Languages: ga

# Name
source: Input Actions
ga: Gníomhartha Ionchurtha

source: Comment
ga: Nóta

# Name
source: Search
ga: Cuardach

# Comment
source: Simple_action
ga: Gníomh simplí

# Comment
source: This group contains various examples demonstrating most of the features of KHotkeys. (Note that this group and all its actions are disabled by default.)
ga: Sa ghrúpa seo, aimseoidh tú samplaí éagsúla a léiríonn formhór na ngnéithe KHotkeys. (Tabhair faoi deara go bhfuil an grúpa seo agus a ghníomhartha go léir díchumasaithe de réir réamhshocraithe.)

# Name
source: Examples
ga: Samplaí

# Comment
source: After pressing Ctrl+Alt+I, the KSIRC window will be activated, if it exists. Simple.
ga: Tar éis duit Ctrl+Alt+I a bhrú, gníomhachtófar an fhuinneog KSIRC, má tá sé ann. Simplí.

# Name
source: Activate KSIRC Window
ga: Gníomhachtaigh Fuinneog KSIRC

# Comment
source: KSIRC window
ga: Fuinneog KSIRC

# Comment
source: After pressing Alt+Ctrl+H the input of 'Hello' will be simulated, as if you typed it. This is especially useful if you have call to frequently type a word (for instance, 'unsigned'). Every keypress in the input is separated by a colon ':'. Note that the keypresses literally mean keypresses, so you have to write what you would press on the keyboard. In the table below, the left column shows the input and the right column shows what to type.\n\n"enter" (i.e. new line) Enter or Return\na (i.e. small a) A\nA (i.e. capital a) Shift+A\n: (colon) Shift+;\n' ' (space) Space
ga: Tar éis duit Alt+Ctrl+H a bhrú, déanfar insamhladh ar ionchur 'Hello' go díreach mar a chlóscríobh tú é. Is úsáideach é seo go háirithe má tá ort focal éigin a chlóscríobh go minic (mar shampla, 'unsigned'). Cuir idirstad ':' idir gach eochairbhrú san ionchur. Tabhair faoi deara go gciallaíonn 'eochairbhrúnna' na heochracha féin a bhrúitear, agus dá bhrí sin ní mór duit a chur isteach na rudaí a chlóscríobhfá ar an méarchlár. Sa tábla thíos, feicfidh tú an t-ionchur sa cholún ar chlé agus na heochracha le brú ar dheis.\n\n"enter" (.i. líne nua) Enter nó Return\na (.i. 'a' beag) A\nA (.i. 'a' mór) Shift+A\n: (idirstad) Shift+;\n' ' (spás) Spásbharra

# Name
source: Type 'Hello'
ga: Clóscríobh 'Hello'

# Comment
source: This action runs Konsole, after pressing Ctrl+Alt+T.
ga: Ritheann an gníomh seo Konsole tar éis Ctrl+Alt+T a bhrú.

# Name
source: Run Konsole
ga: Rith Konsole

# Comment
source: Read the comment on the "Type 'Hello'" action first.\n\nQt Designer uses Ctrl+F4 for closing windows. In KDE, however, Ctrl+F4 is the shortcut for going to virtual desktop 4, so this shortcut does not work in Qt Designer. Further, Qt Designer does not use KDE's standard Ctrl+W for closing the window.\n\nThis problem can be solved by remapping Ctrl+W to Ctrl+F4 when the active window is Qt Designer. When Qt Designer is active, every time Ctrl+W is pressed, Ctrl+F4 will be sent to Qt Designer instead. In other applications, the effect of Ctrl+W is unchanged.\n\nWe now need to specify three things: A new shortcut trigger on 'Ctrl+W', a new keyboard input action sending Ctrl+F4, and a new condition that the active window is Qt Designer.\nQt Designer seems to always have title 'Qt Designer by Trolltech', so the condition will check for the active window having that title.
ga: Léigh an nóta a bhaineann leis an ngníomh "Clóscríobh 'Hello'" ar dtús.\n\nÚsáideann Qt Designer Ctrl+F4 chun fuinneoga a dhúnadh. Ach i KDE, osclaíonn Ctrl+F4 deasc fhíorúil 4 agus dá bhrí sin ní oibríonn sé i Qt Designer. Agus freisin ní úsáideann Qt Designer an t-aicearra (Ctrl+W) chun fuinneog a dhúnadh atá caighdeánach i KDE.\n\nIs féidir an fhadhb seo a réiteach trí Ctrl+W a mhapáil go dtí Ctrl+F4 nuair is é Qt Designer an fhuinneog ghníomhach. Nuair atá Qt Designer gníomhach, seolfar Ctrl+F4 chuig Qt Designer in ionad Ctrl+W gach uair a bhrúitear Ctrl+W. I bhfeidhmchláir eile, oibríonn Ctrl+W mar is gnách.\n\nCaithfidh muid trí rud a shonrú anois: truicear nua don aicearra 'Ctrl+W', gníomh nua ionchurtha a sheolann Ctrl+F4, agus coinníoll nua a deir gur é Qt Designer an fhuinneog ghníomhach.\nDe réir cosúlachta, is é 'Qt Designer by Trolltech' an teideal ar Qt Designer i gcónaí agus dá bhrí sin seiceálfaidh an coinníoll go bhfuil an teideal seo ag an bhfuinneog ghníomhach.

# Name
source: Remap Ctrl+W to Ctrl+F4 in Qt Designer
ga: Athmhapáil Ctrl+W go Ctrl+F4 i Qt Designer

# Comment
source: By pressing Alt+Ctrl+W a D-Bus call will be performed that will show the minicli. You can use any kind of D-Bus call, just like using the command line 'qdbus' tool.
ga: Trí Alt+Ctrl+W a bhrú, déanfar glao D-Bus a thaispeánann an minicli. Is féidir leat aon sórt glao D-Bus a úsáid, go díreach mar a dhéanfá le 'qdbus' ar líne na n-orduithe.

# Comment
source: Read the comment on the "Type 'Hello'" action first.\n\nJust like the "Type 'Hello'" action, this one simulates keyboard input, specifically, after pressing Ctrl+Alt+B, it sends B to XMMS (B in XMMS jumps to the next song). The 'Send to specific window' checkbox is checked and a window with its class containing 'XMMS_Player' is specified; this will make the input always be sent to this window. This way, you can control XMMS even if, for instance, it is on a different virtual desktop.\n\n(Run 'xprop' and click on the XMMS window and search for WM_CLASS to see 'XMMS_Player').
ga: Léigh an nóta a bhaineann leis an ngníomh "Clóscríobh 'Hello'" ar dtús.\n\nDíreach cosúil leis an ngníomh "Clóscríobh 'Hello'", déanann an gníomh seo insamhladh ar ionchur ón mhéarchlár. Go sonrach, tar éis Ctrl+Alt+B a bhrú, seolann sé 'B' chuig XMMS (ciallaíonn 'B' 'Léim go dtí an chéad amhrán eile' i XMMS). Cuirtear tic sa ticbhosca 'Seol chuig fuinneog ar leith' agus tá fuinneog ann lena aicme agus a bhfuil 'XMMS_Player' inti sonraithe; leis seo, seolfar an t-ionchur chuig an bhfuinneog seo i gcónaí. Sa chaoi seo, is féidir leat XMMS a rialú fiú má tá sé ar dheasc fhíorúil eile, mar shampla.\n\n(Rith 'xprop' agus cliceáil an fhuinneog XMMS agus déan cuardach ar WM_CLASS chun 'XMMS_Player' a fheiceáil).

# Name
source: Next in XMMS
ga: An Chéad Amhrán Eile i XMMS

# Comment
source: XMMS window
ga: Fuinneog XMMS

# Comment
source: XMMS Player window
ga: Fuinneog Sheinnteoir XMMS

# Name
source: Konqi Gestures
ga: Gothaí Konqi

# Comment
source: Konqueror window
ga: Fuinneog Konqueror

# Name
source: Back
ga: Siar

# Name
source: Forward
ga: Ar Aghaidh

# Name
source: Up
ga: Suas

# Name
source: Reload
ga: Athluchtaigh

# Comment
source: After pressing Win+E (Tux+E) a WWW browser will be launched, and it will open http://www.kde.org . You may run all kind of commands you can run in minicli (Alt+F2).
ga: Tar éis Win+E (Tux+E) a bhrú, tosófar brabhsálaí Gréasáin, agus osclóidh sé http://www.kde.org/. Is féidir leat gach cineál d'ordú a rith i minicli (Alt+F2).

# Name
source: Go to KDE Website
ga: Téigh go dtí suíomh Gréasáin KDE

# Comment
source: Basic Konqueror gestures.
ga: Bunghothaí Konqueror.

# Name
source: Konqueror Gestures
ga: Gothaí Konqueror

# Comment
source: Press, move left, release.
ga: Brúigh, bog faoi chlé, scaoil.

# Comment
source: Opera-style: Press, move up, release.\nNOTE: Conflicts with 'New Tab', and as such is disabled by default.
ga: De chineál Opera: Brúigh, bog suas, scaoil.\nNÓTA: Tagann sé seo salach ar 'Cluaisín Nua' agus dá bhrí sin tá sé díchumasaithe de réir réamhshocraithe.

# Name
source: Stop Loading
ga: Stop an luchtú

# Comment
source: Going up in URL/directory structure.\nMozilla-style: Press, move up, move left, move up, release.
ga: Bog suas i struchtúr URL/comhadlann.\nDe chineál Mozilla: Brúigh, bog suas, bog faoi chlé, bog suas, scaoil.

# Comment
source: Going up in URL/directory structure.\nOpera-style: Press, move up, move left, move up, release.\nNOTE: Conflicts with "Activate Previous Tab", and as such is disabled by default.
ga: Bog suas i struchtúr URL/comhadlann.\nDe chineál Opera: Brúigh, bog suas, bog faoi chlé, bog suas, scaoil.\nNÓTA: Tagann sé salach ar "Gníomhachtaigh an Cluaisín Roimhe Seo", agus dá bhrí sin tá sé díchumasaithe de réir réamhshocraithe.

# Name
source: Up #2
ga: Suas #2

# Comment
source: Press, move up, move right, release.
ga: Brúigh, bog suas, bog faoi dheis, scaoil.

# Name
source: Activate Next Tab
ga: Gníomhachtaigh an Chéad Chluaisín Eile

# Comment
source: Press, move up, move left, release.
ga: Brúigh, bog suas, bog faoi chlé, scaoil.

# Name
source: Activate Previous Tab
ga: Gníomhachtaigh an Cluaisín Roimhe Seo

# Comment
source: Press, move down, move up, move down, release.
ga: Brúigh, bog síos, bog suas, bog síos, scaoil.

# Name
source: Duplicate Tab
ga: Cóipeáil Cluaisín

# Comment
source: Press, move down, move up, release.
ga: Brúigh, bog síos, bog suas, scaoil.

# Name
source: Duplicate Window
ga: Cóipeáil Fuinneog

# Comment
source: Press, move right, release.
ga: Brúigh, bog faoi dheis, scaoil.

# Comment
source: Press, move down, move half up, move right, move down, release.\n(Drawing a lowercase 'h'.)
ga: Brúigh, bog síos, bog leath bhealaigh suas, bog faoi dheis, bog síos, scaoil.\n(.i. 'h' sa chás íochtair.)

# Name
source: Home
ga: Baile

# Comment
source: Press, move right, move down, move right, release.\nMozilla-style: Press, move down, move right, release.
ga: Brúigh, bog faoi dheis, bog síos, bog faoi dheis, scaoil.\nDe chineál Mozilla: Brúigh, bog síos, bog faoi dheis, scaoil.

# Name
source: Close Tab
ga: Dún an Cluaisín

# Comment
source: Press, move up, release.\nConflicts with Opera-style 'Up #2', which is disabled by default.
ga: Brúigh, bog suas, scaoil.\nTagann sé salach ar an gcineál Opera 'Up #2', atá díchumasaithe de réir réamhshocraithe.

# Name
source: New Tab
ga: Cluaisín Nua

# Comment
source: Press, move down, release.
ga: Brúigh, bog síos, scaoil.

# Name
source: New Window
ga: Fuinneog Nua

# Comment
source: Press, move up, move down, release.
ga: Brúigh, bog suas, bog síos, scaoil.

# Name
source: Custom Shortcuts
ga: Aicearraí Saincheaptha

# Comment
source: Configure Input Actions settings
ga: Cumraigh socruithe na nGníomhartha Ionchurtha
