Repository: Al-tronic/l10n-kde-ga
Catalog: messages/plasma-workspace/plasma-workspace._desktop_.po
Languages: ga

# Name
source: Device Notifier
ga: Fógróir Gléis

# Name
source: Open with File Manager
ga: Oscail le Bainisteoir na gComhad

# Comment
source: KDE Free Space Notifier Daemon
ga: Fógróir Spáis Shaoir KDE

# Name
source: Low Disk Space
ga: Easpa Spáis ar an Diosca

# Name
source: Warning
ga: Rabhadh

# Comment
source: Used for warning notifications
ga: Úsáidte do rabhaidh

# Name
source: Running low on disk space
ga: Tá an diosca ag éirí lán

# Comment
source: You are running low on disk space
ga: Tá an diosca ag éirí lán

# GenericName
source: Font Installer
ga: Cló Suiteálaí

# GenericName
source: Font Viewer
ga: Cló

# Name
source: Font Installer
ga: Cló Suiteálaí

# Name
source: Fonts
ga: Clónna

# Name
source: GNOME/GTK Application Styles
ga: GNOME/GTK Stíleanna Feidhmchláir

# Name
source: Trash
ga: Bruscar

# GenericName
source: Clipboard Tool
ga: Uirlis Ghearrthaisce

# Comment
source: A cut & paste history utility
ga: Uirlis staire gearrtha agus greamaithe

# Comment
source: Plasma by KDE
ga: Plasma le KDE

# Name
source: Plasma (Development, Wayland ${CMAKE_INSTALL_FULL_BINDIR})
ga: Plasma (Forbairt, Wayland ${CMAKE_INSTALL_FULL_BINDIR})

# Name
source: Plasma (Development, X11 ${CMAKE_INSTALL_FULL_BINDIR})
ga: Plasma (Forbairt, X11 ${CMAKE_INSTALL_FULL_BINDIR})

# Name
source: Development
ga: Forbairt

# Name
source: Translation
ga: Aistriúchán

# Name
source: Web Development
ga: Forbairt Ghréasáin

# Name
source: Editors
ga: Eagarthóirí

# Name
source: Languages
ga: Teangacha

# Name
source: Mathematics
ga: Matamaitic

# Name
source: Miscellaneous
ga: Éagsúil

# Name
source: Science
ga: Eolaíocht

# Name
source: Teaching Tools
ga: Uirlisí Múinteoireachta

# Name
source: Arcade
ga: Stuara Siamsa

# Name
source: Board Games
ga: Cluichí Cláir

# Name
source: Card Games
ga: Cluichí Cártaí

# Name
source: Games
ga: Cluichí

# Name
source: Games for Kids
ga: Cluichí do Pháistí

# Name
source: Logic Games
ga: Cluichí Loighce

# Name
source: Rogue-like Games
ga: Cluichí cosúil le Rogue

# Name
source: Tactics & Strategy
ga: Beartaíocht agus Straitéisí

# Name
source: Graphics
ga: Grafaic

# Name
source: Internet
ga: Idirlíon

# Name
source: Terminal Applications
ga: Teirminéal Feidhmchláir

# Name
source: KDE Menu
ga: Roghchlár KDE

# Name
source: More Applications
ga: Níos Mó Feidhmchláir

# Name
source: Multimedia
ga: Ilmheáin

# Name
source: Office
ga: Oifig

# Name
source: Science & Math
ga: Eolaíocht agus Matamaitic

# Name
source: Settings
ga: Socruithe

# Name
source: System
ga: Córas

# Name
source: Toys
ga: Áilleagáin

# Name
source: Lost & Found
ga: Earraí Caillte

# Name
source: Accessibility
ga: Inrochtaineacht

# Comment
source: Accessibility
ga: Inrochtaineacht

# Name
source: Desktop
ga: Deasc

# Comment
source: Desktop
ga: Deasc

# Name
source: File
ga: Comhad

# Comment
source: File
ga: Comhad

# Name
source: Peripherals
ga: Forimeallaigh

# Comment
source: Peripherals
ga: Forimeallaigh

# Comment
source: X Window Utilities
ga: Uirlisí Fuinneoga X

# Name
source: Linux Kernel
ga: An Eithne Linux

# Name
source: File Search
ga: Comhad Cuardaigh

# Name
source: Desktop Search
ga: Deisce Cuardaigh

# Name
source: Plasma Desktop Workspace
ga: Spás Oibre Deisce Plasma

# Name
source: Plasma Session Save
ga: Plasma Seisiún Sábhála

# Comment
source: Built-in unthemed CDE style
ga: Stíl insuite CDE gan téamaí

# Comment
source: Built-in unthemed style similar to Clearlooks from GNOME
ga: Stíl insuite gan téamaí cosúil le Clearlooks ó GNOME

# Name
source: GTK+ Style
ga: Stíl GTK+

# Comment
source: Style that uses the GTK+ theming engine
ga: Stíl a úsáideann an t-inneall téamaí GTK+

# Comment
source: Built-in unthemed Motif style
ga: Stíl insuite Motif gan téamaí

# Comment
source: Built-in unthemed style similar to Plastik from KDE3
ga: Stíl insuite gan téamaí cosúil le Plastik ó KDE3

# Comment
source: Built-in unthemed Windows 9x style
ga: Stíl insuite Windows 9x gan téamaí

# Comment
source: Multimedia System
ga: Córas Ilmheán

# Name
source: Audio Output Device Changed
ga: Athraíodh an Gléas Aschurtha Fuaime

# Comment
source: Notification when audio output device has automatically changed
ga: Fógra nuair a athraítear an gléas aschurtha fuaime go huathoibríoch

# Name
source: Plasma Style
ga: Plasma Stíle

# Description
source: Jpeg-Image
ga: Íomhá JPEG

# Description
source: Launch &Gwenview
ga: Tosaigh &Gwenview

# Description
source: Web-URL
ga: URL Gréasáin

# Description
source: Open with &default Browser
ga: Oscail leis an mBrabhsálaí &réamhshocraithe

# Description
source: Open with &Konqueror
ga: Oscail le &Konqueror

# Description
source: Open with &Mozilla
ga: Oscail le &Mozilla

# Description
source: Send &URL
ga: Seol &URL

# Description
source: Open with &Firefox
ga: Oscail le &Firefox

# Description
source: Send &Page
ga: Seol &Leathanach

# Description
source: Mail-URL
ga: URL Ríomhphoist

# Description
source: Launch &Kmail
ga: Tosaigh &Kmail

# Description
source: Launch &mutt
ga: Tosaigh &mutt

# Description
source: Text File
ga: Téacschomhad

# Description
source: Launch K&Write
ga: Tosaigh K&Write

# Description
source: Local file URL
ga: URL de chomhad logánta

# Description
source: Send &File
ga: Seol &Comhad

# Description
source: Gopher URL
ga: URL Gopher

# Description
source: ftp URL
ga: URL ftp
