Repository: Al-tronic/l10n-kde-ga
Catalog: messages/kdiamond/kdiamond._desktop_.po
Languages: ga

# Comment
source: KDiamond Game
ga: Cluiche KDiamond

# Name
source: Game
ga: Cluiche

# Comment
source: Sounds that appear during a game
ga: Fuaimeanna le linn cluiche

# Name
source: Diamonds removed
ga: Baineadh muileataí

# Comment
source: Diamonds were removed.
ga: Baineadh muileataí.

# Name
source: Diamonds moving
ga: Muileataí á mbogadh

# Comment
source: Diamonds are moving.
ga: Muileataí á mbogadh.

# Name
source: Game over
ga: Cluiche thart

# Comment
source: Time is up.
ga: Tá an cluiche críochnaithe.

# GenericName
source: Three-in-a-row game
ga: Cluiche boird trí-cinn-as-a-chéile

# Name
source: Egyptian
ga: Éigipteach

# Description
source: Egyptian style theme.
ga: Téama ar nós na nÉigipteach.

# Description
source: A theme based on real looking diamonds.
ga: Téama bunaithe ar dhiamaint réalaíocha.

# Name
source: Funny Zoo
ga: Zú Greannmhar

# Description
source: It is a fun time in the jungle! Help animals find their families. And watch out for those hard to find frogs.
ga: Craic sa dufair! Cabhraigh leis na hainmhithe a muintir a aimsiú. Agus bí ag fairís ar na froganna seachantacha sin.
