Repository: Al-tronic/l10n-kde-ga
Catalog: messages/konsole/konsole._desktop_.po
Languages: ga

# Name
source: Bell in Focused Session
ga: Clog i Seisiún Dírithe

# Comment
source: Bell emitted within a focused session
ga: Cloigín a eisíodh laistigh de sheisiún dírithe

# Name
source: Bell in Non-Focused Session
ga: Clog i Seisiún Neamhfhócasaithe

# Comment
source: Bell emitted within a non-focused session
ga: Cloigín a eisíodh laistigh de sheisiún neamhfhócasaithe

# Name
source: Activity in Non-Focused Monitored Session
ga: Gníomhaíocht i Seisiún Monatóireachta Neamhfhócasaithe

# Comment
source: Activity detected in a non-focused monitored session
ga: Gníomhaíocht braite i seisiún monatóireachta neamhfhócasaithe

# Name
source: Activity in Monitored Session
ga: Gníomhaíocht i Seisiún Monatóirithe

# Comment
source: Activity detected in a monitored session
ga: Braitheadh gníomhaíocht i seisiún monatóirithe

# Name
source: Silence in Non-Focused Monitored Session
ga: Ciúnas i Seisiún Monatóireachta Neamhfhócasaithe

# Comment
source: Silence detected in a non-focused monitored session
ga: Tost braite i seisiún monatóireachta neamhfhócasaithe

# Name
source: Silence in Monitored Session
ga: Ciúnas i Seisiún Monatóirithe

# Comment
source: Silence detected in a monitored session
ga: Braitheadh ciúnas i seisiún monatóirithe

# Name
source: Process finished in Non-Focused Monitored Session
ga: Próiseas críochnaithe i Seisiún Monatóireachta Neamhfhócasaithe

# Comment
source: Process finished in a non-focused monitored session
ga: Próiseas críochnaithe i seisiún monatóireachta neamhfhócasaithe

# Name
source: Process finished in Monitored Session
ga: Próiseas críochnaithe i Seisiún Monatóireachta

# Comment
source: Process finished in a monitored session
ga: Próiseas críochnaithe i seisiún monatóireachta

# Name
source: Session Finished With Non-Zero Status
ga: Chríochnaigh an Seisiún le Stádas nach bhfuil 0

# Comment
source: A session has exited with non-zero status
ga: Chríochnaigh seisiún le stádas nach bhfuil 0

# Name
source: Process Triggered a Notification in a Focused Session
ga: Chuir an próiseas fógra i ngníomh i seisiún dírithe

# Comment
source: Notification emitted by a process in a focused session
ga: Fógra arna eisiúint ag próiseas i seisiún dírithe

# Name
source: Process Triggered a Notification in a Non-Focused Session
ga: Chuir an próiseas fógra i ngníomh i seisiún neamhfhócasaithe

# Comment
source: Notification emitted by a process in a non-focused session
ga: Fógra a eisítear ag próiseas i seisiún neamhfhócasaithe

# Name
source: Shell prompt triggered a notification in a non-focused session
ga: Spreag leid Shell fógra i seisiún neamhfhócasaithe

# Comment
source: Shell prompt triggered a notification in a non-focused session
ga: Spreag leid Shell fógra i seisiún neamhfhócasaithe

# Name
source: Shell prompt triggered a notification
ga: Spreag leid Shell fógra

# Comment
source: Shell prompt triggered a notification
ga: Spreag leid Shell fógra

# Name
source: Terminal Emulator
ga: Aithriseoir Teirminéil

# Comment
source: Command line access
ga: Rochtain líne ordaithe

# Name
source: Run In Konsole
ga: Rith i Konsole

# Comment
source: Run within Konsole
ga: Rith laistigh de Konsole

# GenericName
source: Terminal
ga: Teirminéal

# Name
source: Open a New Window
ga: Oscail Fuinneog Nua

# Name
source: Open a New Tab
ga: Oscail Cluaisín Nua
