Repository: Al-tronic/l10n-kde-ga
Catalog: messages/libkmahjongg/libkmahjongg._desktop_.po
Languages: ga

# Name
source: Chinese Landscape
ga: Tírdhreach Síneach

# Description
source: Chinese landscape with mountains and a waterfall
ga: Tírdhreach Síneach le sléibhte agus eas

# Name
source: Plain Color
ga: Gnáthdhath

# Description
source: Use the default window background color.
ga: Úsáid an dath réamhshocraithe do chúlra fuinneog.

# Name
source: Default
ga: Réamhshocrú

# Description
source: A green background with light geometric patterns
ga: Cúlra uaine le patrúin éadroma geoiméadracha

# Name
source: Egyptian
ga: Éigipteach

# Description
source: A Egyptian style background
ga: Cúlra ar nós na nÉigipteach

# Name
source: Summer Field
ga: Faiche Shamhraidh

# Description
source: The Summertime Greens
ga: Faiche Shamhraidh

# Name
source: Light Wood
ga: Adhmad Geal

# Description
source: Resembles the surface of a wood table
ga: Cosúil le tábla adhmaid

# Name
source: Alphabet
ga: Aibítir

# Description
source: A colorful tileset designed for kids of all ages.
ga: Tacar tíleanna ildathacha ar son páistí de gach aois.

# Name
source: Classic
ga: Clasaiceach

# Description
source: Chinese tileset, inspired by the classic version shipped with KDE 3
ga: Tíleanna Síneacha, faoi anáil an leagain chlasaicigh a tháinig le KDE 3

# Description
source: Art inspired by real Japanese Mahjongg tiles
ga: Ealaín faoi anáil tíleanna Seapánacha Mahjongg

# Name
source: Imperial Jade
ga: Séad Impiriúil

# Name
source: Traditional
ga: Traidisiúnta

# Description
source: Americanized tiles inspired by Japanese Mahjongg tiles
ga: Tíleanna Meiriceánaithe faoi anáil tíleanna Seapánacha Mahjongg
