Repository: Al-tronic/l10n-kde-ga
Catalog: trunk6/messages/kcoreaddons/kde6_xml_mimetypes.po
Languages: ga

# comment
source: CD audio
ga: Fuaim dhlúthdhiosca

# comment
source: SNF bitmap font
ga: Cló Giotánmhapach SNF

# comment
source: Java applet
ga: Feidhmchláirín Java

# comment
source: KDE color scheme
ga: Téama dathanna de chuid KDE

# comment
source: KNewStuff package
ga: Pacáiste KNewStuff

# comment
source: KWallet wallet
ga: Sparán KWallet

# comment
source: plasmoid
ga: plasmóid

# comment
source: SuperKaramba theme
ga: Téama SuperKaramba

# comment
source: Calligra Plan project management document
ga: Cáipéis Bhainisteoireachta Tionscadail Calligra Plan

# comment
source: Calligra Plan work package document
ga: Cáipéis phacáiste oibre Calligra Plan

# comment
source: KPlato project management document
ga: Cáipéis Bhainisteoireachta Tionscadail KPlato

# comment
source: KPlato project management work package
ga: Pacáiste oibre bainisteoireachta tionscadail KPlato

# comment
source: Kugar archive
ga: Cartlann Kugar

# comment
source: web archive
ga: cartlann ghréasáin

# comment
source: W3C XML schema
ga: Scéimre XML W3C

# comment
source: KPhotoAlbum import
ga: Iompórtáil KPhotoAlbum

# comment
source: HDR image
ga: Íomhá HDR

# comment
source: KDE raw image formats
ga: Formáidí amha íomhánna de chuid KDE

# comment
source: Intel® hexadecimal object file
ga: Comhad oibiachta heicsidheachúlach Intel®

# comment
source: Kate file list loader plugin list
ga: Liosta de bhreiseáin luchtaithe liostaí comhad do Kate

# comment
source: abc musical notation file
ga: Comhad nodaireachta ceoil abc

# comment
source: fonts package
ga: pacáiste clónna

# comment
source: Windows server
ga: Freastalaí Windows

# comment
source: Windows workgroup
ga: Grúpa oibre Windows

# comment
source: KDE system monitor
ga: Monatóir an chórais KDE

# comment
source: KDE theme
ga: Téama KDE

# comment
source: Quanta project
ga: Tionscadal Quanta

# comment
source: Kommander file
ga: Comhad Kommander

# comment
source: potato
ga: práta

# comment
source: Kolf saved game
ga: Cluiche sábháilte Kolf

# comment
source: Kolf course
ga: Cúrsa Kolf

# comment
source: Okular document archive
ga: Cartlann cáipéisí Okular

# comment
source: Cabri figure
ga: Léaráid Cabri

# comment
source: Dr. Geo figure
ga: Léaráid Dr. Geo

# comment
source: KGeo figure
ga: Léaráid KGeo

# comment
source: Kig figure
ga: Léaráid Kig

# comment
source: KSeg document
ga: Cáipéis KSeg

# comment
source: vocabulary trainer document
ga: cáipéis traenálaí stóir focal

# comment
source: KmPlot file
ga: Comhad KmPlot

# comment
source: KWordQuiz vocabulary
ga: Stór Focal KWordQuiz

# comment
source: Cachegrind/Callgrind profile dump
ga: Próifíl dhumpáilte Cachegrind/Callgrind

# comment
source: Umbrello UML Modeller file
ga: Samhaltóir UML Umbrello

# comment
source: Windows link
ga: Nasc Windows

# comment
source: KGet download list
ga: Liosta íosluchtuithe KGet

# comment
source: Kopete emoticons archive
ga: Cartlann straoiseog Kopete

# comment
source: ICQ contact
ga: Teagmháil ICQ

# comment
source: Microsoft Media Format
ga: Formáid Mheán Microsoft

# comment
source: Turtle RDF document
ga: Cáipéis RDF Turtle

# comment
source: Softimage PIC image
ga: Íomhá PIC Softimage

# comment
source: KConfigXT Configuration Options
ga: KConfigXT Roghanna Cumrú

# comment
source: KConfigXT Code Generation Options
ga: KConfigXT Roghanna Cód Giniúintí

# comment
source: KXMLGUI UI Declaration
ga: KXMLGUI UI Dearbhaithe

# comment
source: KNotification Declaration
ga: KNotification Dearbhaithe

# comment
source: KCrash Report
ga: KCrash Tuairisc
