Repository: Al-tronic/l10n-kde-ga
Catalog: messages/kolf/kolf._desktop_.po
Languages: ga

# Name
source: Classic
ga: Clasaiceach

# Name
source: Easy Course
ga: Cúrsa Éasca

# Comment
source: Hit slowly...
ga: Buail go mall...

# Name
source: Hard Course
ga: Cúrsa Deacair

# Comment
source: Let the floaters <strong>push</strong> you!
ga: Lig do na snámhóirí thú a <strong>bhrú</strong>!

# Name
source: Impossible Course
ga: Cúrsa Dodhéanta

# Comment
source: Reprieve
ga: Faoiseamh

# Comment
source: Luck
ga: Ádh

# Comment
source: Chaos
ga: Cíor Thuathail

# Name
source: Medium Course
ga: Cúrsa Measartha Deacair

# Name
source: Slope Practise
ga: Cleachtadh ar Fhána

# Name
source: Really Easy
ga: An-Éasca

# Name
source: USA Pro
ga: Proifisiúnta S.A.M.

# Comment
source: Daytona Beach, FL
ga: Daytona Beach, Florida

# Comment
source: Palm Springs, CO
ga: Palm Springs, Colorado

# Comment
source: Las Vegas, NV
ga: Las Vegas, Nevada

# Comment
source: San Francisco, CA
ga: San Francisco, California

# Comment
source: Lake Tahoe, CA/NV
ga: Lake Tahoe, California/Nevada

# Comment
source: Florida Keys, FL
ga: Florida Keys, Florida

# Comment
source: Niagara Falls, NY
ga: Niagara Falls, Nua-Eabhrac

# GenericName
source: Miniature Golf
ga: Mionghalf

# Name
source: Kolf Default Theme
ga: Téama Réamhshocraithe Kolf

# Description
source: Kolf Default Theme
ga: Téama Réamhshocraithe Kolf

# Name
source: Tutorial Course
ga: Cúrsa Teagaisc

# Comment
source: <h3>Welcome</h3> to the tutorial course for Kolf!
ga: <h3>Fáilte</h3> romhat go dtí an cúrsa teagaisc Kolf!

# Comment
source: To hit the ball, press and hold the Down Arrow or left mouse button. How long you hold down the mouse button or key determines strength of the shot.
ga: Chun an liathróid a bhualadh, brúigh agus coinnigh an tSaighead Síos nó an cnaipe luiche ar chlé síos. Chun an liathróid a bhualadh níos láidre, coinnigh an eochair nó an cnaipe síos níos faide.

# Comment
source: To aim the putter, press the Left (rotate counterclockwise) and Right (rotate clockwise) Arrow keys or use the mouse.
ga: Chun an t-amasán a dhíriú, brúigh an tSaighead Chlé (tuathalach) nó an tSaighead Dheas (deisealach), nó bain úsáid as an luch.

# Comment
source: <h3>Bridges</h3>Bridges can have walls on the top, bottom, left, or right.
ga: <h3>Droichid</h3>Is féidir ballaí a bheith ar dhroichead, ar an mbarr, ar an mbun, ar dheis, nó ar chlé.

# Comment
source: <h3>Everything</h3>Here's a hole that has it all. Have fun with Kolf!<br><center>-- Jason Katz-Brown</center>
ga: <h3>Gach Rud Faoi Rothaí na Gréine</h3>Tá gach rud ag an bpoll seo. Bain sult as Kolf!<br><center>-- Jason Katz-Brown</center>

# Comment
source: <h3>Slopes</h3>Slopes are slanted areas of ground that push the ball in the direction that they slope. This direction is shown when you choose <u>Hole->Show Info</u>.
ga: <h3>Fánaí</h3>Is éard atá i bhfána ná talamh claonta a bhrúnn an liathróid i dtreo an chlaonta. Taispeánfar an treo seo duit nuair a roghnaíonn tú <u>Poll->Taispeáin Eolas</u>.

# Comment
source: Hit the ball onto the slope and let it roll into cup.
ga: Buail an liathróid ar an bhfána agus lig dó rothlú isteach sa pholl.

# Comment
source: Try out these different types of slopes.
ga: Bain triail as na cineálacha éagsúla fána seo.

# Comment
source: The steepness of a slope is shown when you choose <u>Hole->Show Info</u>. Steepness goes from 8 (steepest) to 1 (shallowest).
ga: Taispeántar géire na fána nuair a roghnaíonn tú <u>Poll->Taispeáin Eolas</u>. Ritheann luachanna na géire ó 1 (is cothroime) go 8 (is géire).

# Comment
source: <h3>Walls</h3>Bounce the ball off of the red walls.
ga: <h3>Ballaí</h3>Preab an liathróid de na ballaí dearga.

# Comment
source: <h3>Sand</h3>Sand is yellow, and slows your ball down.
ga: <h3>Gaineamh</h3>Is buí é an gaineamh agus cuireann sé moill ar do liathróid.

# Comment
source: <h3>Puddles (Water)</h3>Hitting into a puddle (blue) adds a penalty stroke to your score, and your ball is placed outside the puddle.
ga: <h3>Locháiníní (Uisce)</h3>Má bhuaileann tú an liathróid i locháinín (gorm), cuirfear pionós buille le do scór, agus cuirfear do liathróid síos lasmuigh den locháinín.

# Comment
source: <h3>Windmills</h3>Windmills (brown base with moving arm) have brown walls (or half walls). The speed of the windmill arm may vary for each hole.
ga: <h3>Muilte Gaoithe</h3>Tá ballaí (nó leathbhallaí) donna ag muilte gaoithe. Athraíonn luas na n-eití ag gach poll.

# Comment
source: <h3>Black Holes</h3>Black Holes transport the ball to their exit, and eject it at a speed in direct relation to the speed your ball was traveling. Choose <u>Hole->Show Info</u> to see which Black Hole goes to which exit and the direction the ball will come out.
ga: <h3>Dúphoill</h3>Iompraíonn dúpholl liathróid go dtí an tslí amach, agus caitheann sé é amach le luas i gcomhréir díreach leis an luas nuair a chuaigh sé isteach sa pholl. Roghnaigh <u>Poll->Taispeáin Eolas</u> chun slí amach gach poill a fheiceáil, agus treo na liathróide nuair a thiocfaidh sé amach.

# Comment
source: <h3>Floaters</h3>Floaters are moving platforms that carry a ball that lands on it. Floaters' speeds vary.
ga: <h3>Snámhóirí</h3>Is éard atá i snámhóir ná ardán gluaisteach a iompraíonn liathróid a thiteann air. Beidh luas difriúil ag gach snámhóir.
