Repository: Al-tronic/l10n-kde-ga
Catalog: messages/kreversi/kreversi._desktop_.po
Languages: ga

# Comment
source: KReversi Game
ga: Cluiche KReversi

# Name
source: Click
ga: Cliceáil

# Comment
source: Click
ga: Cliceáil

# Name
source: Game Won
ga: Cluiche Buaite

# Comment
source: Game won
ga: Cluiche buaite

# Name
source: Game Lost
ga: Cluiche Caillte

# Comment
source: Game lost
ga: Cluiche caillte

# Name
source: Draw
ga: Tarraing

# Comment
source: Draw
ga: Tarraing

# Name
source: Illegal Move
ga: Beart Neamhcheadaithe

# Comment
source: Illegal move
ga: Beart neamhcheadaithe

# GenericName
source: Reversi Board Game
ga: Cluiche Cláir Reversi

# Name
source: KReversi Default Theme
ga: Téama Réamhshocraithe KReversi
