Repository: Al-tronic/l10n-kde-ga
Catalog: messages/kate/katesearch.po
Languages: ga

source: Usage: grep [pattern to search for in folder]
ga: Úsáid: grep [patrún le cuardach a dhéanamh sa bhfillteán]

source: Usage: newGrep [pattern to search for in folder]
ga: Úsáid: newGrep [patrún le cuardach sa bhfillteán]

source: Usage: search [pattern to search for in open files]
ga: Úsáid: cuardach [patrún le cuardach a dhéanamh i gcomhaid oscailte]

source: Usage: pgrep [pattern to search for in current project]
ga: Úsáid: pgrep [patrún le cuardach sa tionscadal reatha]

source: Usage: newPGrep [pattern to search for in current project]
ga: Úsáid: newPGrep [patrún le cuardach sa tionscadal reatha]

source: Usage: preg [regex pattern to search for in current project]
ga: Úsáid: preg [patrún regex le cuardach sa tionscadal reatha]

source: Export Search Result Matches
ga: Easpórtáil Torthaí Cuardaigh

source: Export Pattern
ga: Patrún Easpórtála

source: Generate
ga: Gin

source: Result
ga: Toradh

source: <b><i>Generating file list: ...%1</i></b>
ga: <b><i>Liosta comhad á ghiniúint: ...%1</i></b>

source: <b><i>One match found, searching: ...%2</i></b>
ga: <b><i>Fuarthas cluiche amháin, ag cuardach: ...%2</i></b>

source: <b><i>One match found, searching: %2</i></b>
ga: <b><i>Fuarthas cluiche amháin, ag cuardach: %2</i></b>

source: One checked
ga: Seiceáilte amháin

source: <b><i>One match (%2) found in file</i></b>
ga: <b><i>Aon mheaitseáil amháin (%2) aimsithe sa chomhad</i></b>

source: <b><i>One match (%2) found in open files</i></b>
ga: <b><i>Fuarthas cluiche amháin (%2) i gcomhaid oscailte</i></b>

source: <b><i>One match (%3) found in folder %2</i></b>
ga: <b><i>Fuarthas cluiche amháin (%3) i bhfillteán %2</i></b>

source: <b><i>One match (%4) found in project %2 (%3)</i></b>
ga: <b><i>Fuarthas cluiche amháin (%4) i dtionscadal %2 (%3)</i></b>

source: <b><i>One match (%3) found in all open projects (common parent: %2)</i></b>
ga: <b><i>Fuarthas cluiche amháin (%3) i ngach tionscadal oscailte (tuismitheoir coiteann: %2)</i></b>

source: Generating file list: ...%1
ga: Ag giniúint liosta comhad: ...%1

source: One match found, searching: ...%2
ga: Fuarthas cluiche amháin, ag cuardach: ...%2

source: One match found, searching: %2
ga: Fuarthas cluiche amháin, ag cuardach: %2

source: One match (%2) found in file
ga: Fuarthas cluiche amháin (%2) sa chomhad

source: One match (%2) found in open files
ga: Fuarthas cluiche amháin (%2) i gcomhaid oscailte

source: One match (%3) found in folder %2
ga: Fuarthas cluiche amháin (%3) i bhfillteán %2

source: One match (%4) found in project %2 (%3)
ga: Fuarthas cluiche amháin (%4) i dtionscadal %2 (%3)

source: One match (%3) found in all open projects (common parent: %2)
ga: Fuarthas cluiche amháin (%3) i ngach tionscadal oscailte (tuismitheoir coiteann: %2)

source: Filter…
ga: Scagaire…

source: Search in current tab; press and hold Ctrl to search in a new tab.
ga: Cuardaigh sa chluaisín reatha; brúigh agus coinnigh Ctrl chun cuardach a dhéanamh i gcluaisín nua.

source: Search
ga: Cuardaigh

source: Replace Checked
ga: Athsholáthar Seiceáilte

source: Next
ga: Ar Aghaidh

source: Stop
ga: Stad

source: Match case
ga: Cás meaitseála

source: <html><head/><body><p>Enable regular expressions. Find help for regex syntax by using the buttons in the search and replace text fields.</p></body></html>
ga: <html><head/><body><p>Cumasaigh nathanna rialta. Faigh cabhair le haghaidh comhréir regex trí na cnaipí sna réimsí téacs cuardaigh agus athsholáthair a úsáid.</p></body></html>

source: Expand results
ga: Leathnaigh na torthaí

source: Replace
ga: Athsholáthair

source: In Current File
ga: Sa Chomhad Reatha

source: In Open Files
ga: I gComhaid Oscailte

source: In Folder
ga: I bhFillteán

source: Use the current document's path.
ga: Úsáid conair na cáipéise reatha.

source: Show more search options
ga: Taispeáin níos mó roghanna cuardaigh

source: Add new search tab
ga: Cuir cluaisín cuardaigh nua leis

source: Folder:
ga: Fillteán:

source: Go one folder up.
ga: Téigh fillteán amháin suas.

source: Filter:
ga: Scagaire:

source: Exclude:
ga: Eisiamh:

source: Recursive
ga: Athchúrsach

source: Include hidden
ga: Cuir i bhfolach san áireamh

source: Follow symbolic links
ga: Lean naisc shiombalacha

source: Include binary files
ga: Cuir comhaid dénártha san áireamh

source: Size limit
ga: Teorainn méide

source: Line break
ga: Briseadh líne

source: Tab
ga: Táb

source: Beginning of line
ga: Tús na líne

source: End of line
ga: Deireadh na líne

source: Any single character (excluding line breaks)
ga: Aon charactar aonair (seachas bristeacha líne)

source: Literal dot
ga: Ponc liteartha

source: One or more occurrences
ga: Ceann amháin nó níos mó

source: Zero or more occurrences
ga: Náid nó níos mó

source: Zero or one occurrences
ga: Náid nó ceann amháin

source: <a> through <b> occurrences
ga: idir <a> agus <b> uair

source: Group, capturing
ga: Grúpáil, gabháil

source: Or
ga: Nó

source: Set of characters
ga: Tacar carachtar

source: Negative set of characters
ga: Tacar diúltaithe carachtar

source: Group, non-capturing
ga: Grúpa, gan ghabháil

source: Lookahead
ga: Réamhfheiceáil

source: Negative lookahead
ga: Réamhfheiceáil dhiúltach

source: Word boundary
ga: Fóir focal

source: Not word boundary
ga: Ní fóir focal é

source: Non-digit
ga: Neamhdhigit

source: Whitespace (excluding line breaks)
ga: Spás bán (seachas bristeacha líne)

source: Non-whitespace (excluding line breaks)
ga: Gan spás bán (gan briseadh líne san áireamh)

source: Word character (alphanumerics plus '_')
ga: Carachtar focail (carachtair alfa-uimhriúla agus '_')

source: Non-word character
ga: Carachtar neamhfhocail

source: Regular expression capture 0 (whole match)
ga: Gabháil nathanna rialta 0 (meaitseáil iomlán)

source: Regular expression capture 1-9
ga: Gabháil nathanna rialta 1-9

source: Regular expression capture 0-999
ga: Gabháil nathanna rialta 0-999

source: Upper-cased capture 0-9
ga: Gabháil i litreacha móra 0-9

source: Upper-cased capture 0-999
ga: Gabháil i litreacha móra 0-999

source: Lower-cased capture 0-9
ga: Gabháil i litreacha beaga 0-9

source: Lower-cased capture 0-999
ga: Gabháil i litreacha beaga 0-999

source: Search & Replace
ga: Cuardaigh & Ionadaigh

source: Find in Files
ga: Aimsigh i gComhaid

source: Find in Files (in a New Tab)
ga: Aimsigh i gComhaid (i gCluaisín Nua)

source: Go to Next Match
ga: Téigh go dtí an Chéad Chluiche Eile

source: Go to Previous Match
ga: Téigh go dtí an Cluiche Roimhe Seo

source: Cut Matching Lines
ga: Gearr Línte Meaitseála

source: This will cut all highlighted search match lines from the current document to the clipboard
ga: Gearrfar leis seo na línte cuardaigh uile atá aibhsithe ón doiciméad reatha go dtí an ghearrthaisce

source: Copy Matching Lines
ga: Cóipeáil Línte Meaitseála

source: This will copy all highlighted search match lines in the current document to the clipboard
ga: Cóipeálfaidh sé seo na línte cuardaigh uile atá aibhsithe sa doiciméad reatha chuig an ghearrthaisce

source: Comma separated list of file types to search in. Example: "*.cpp,*.h"
ga: Liosta cineálacha comhad scartha le camóga le cuardach a dhéanamh ann. Sampla: "*.cpp,*.h"

source: Comma separated list of wildcard patterns to match files or directory names to exclude from the search. Example: "build*" If the pattern contains a '/', the whole path is checked for a match.
ga: Liosta patrún fiáin scartha le camóga chun meaitseáil le hainmneacha comhad nó eolaire atá le heisiamh ón gcuardach. Sampla: "build*" Má tá '/' sa phatrún, déantar seiceáil ar an gcosán iomlán le haghaidh meaitseáil.

source: Click to filter through results
ga: Cliceáil chun scagadh a dhéanamh trí na torthaí

source: Find
ga: Aimsigh

source: Search was not started as directory '%1' to search in doesn't exist.
ga: Níor cuireadh tús leis an gcuardach mar níl an eolaire '%1' le cuardach ann ann.

source: Searching while you type was interrupted. It would have taken too long.
ga: Cuireadh isteach ar an gcuardach agus tú ag clóscríobh. Bheadh ​​sé ró-fhada.

source: Search Match
ga: Cuardaigh Meaitseáil

source: Next from cursor
ga: Ar Aghaidh ón gcúrsóir

source: Starting from first match
ga: Ag tosú ón gcéad chluiche

source: Continuing from first match
ga: Ag leanúint ón gcéad chluiche

source: Starting from last match
ga: Ag tosú ón gcluiche deireanach

source: Continuing from last match
ga: Ag leanúint ón gcluiche deireanach

source: Search: %1
ga: Cuardaigh: %1

source: Copy all
ga: Cóipeáil gach rud

source: Copy expanded
ga: Cóip leathnaithe

source: Export matches
ga: Easpórtáil cluichí

source: Open as Editor Tab
ga: Oscail mar Chluaisín Eagarthóra

source: Clear
ga: Glan

source: Add...
ga: Cuir Leis...

source: Search As You Type
ga: Cuardaigh agus tú ag clóscríobh

source: In Current Project
ga: Sa Tionscadal Reatha

source: In All Open Projects
ga: I ngach tionscadal oscailte

source: &Edit
ga: &Eagar

source: Find in Files Variants
ga: Aimsigh i gComhaid Malartacha
