Repository: Al-tronic/l10n-kde-ga
Catalog: messages/kate/kateproject.po
Languages: ga

source: Select branch to checkout. Press 'Esc' to cancel.
ga: Roghnaigh brainse le seiceáil amach. Brúigh 'Esc' le cealú.

source: Branch %1 checked out
ga: Seiceáilte amach brainse %1

source: Failed to checkout to branch %1, Error: %2
ga: Theip ar an tseiceáil amach chuig brainse %1, Earráid: %2

source: Enter new branch name. Press 'Esc' to cancel.
ga: Cuir isteach ainm nua na brainse. Brúigh 'Esc' le cealú.

source: Select branch to checkout from. Press 'Esc' to cancel.
ga: Roghnaigh brainse le seiceáil amach uaidh. Brúigh 'Esc' le cealú.

source: Checked out to new branch: %1
ga: Seiceáilte amach chuig brainse nua: %1

source: Failed to create new branch. Error "%1"
ga: Theip ar bhrainse nua a chruthú. Earráid "%1"

source: Branch
ga: Brainse

source: Last Activity
ga: Gníomhaíocht Dheiridh

source: Last Commit
ga: Tiomantas Deiridh

source: Delete
ga: Scrios

source: Are you sure you want to delete the selected branch?
ga: An bhfuil tú cinnte gur mian leat an brainse roghnaithe a scriosadh?

source: Select Branch...
ga: Roghnaigh Brainse...

source: Create New Branch
ga: Cruthaigh Brainse Nua

source: Create New Branch From...
ga: Cruthaigh Brainse Nua Ó...

source: Back
ga: Ar ais

# Tooltip text, describing that '%1' commit is checked out
source: HEAD at commit %1
ga: CEANN ag tiomnú %1

# Tooltip text, describing that '%1' tag is checked out
source: HEAD is at this tag %1
ga: Tá HEAD ag an gclib seo %1

# Tooltip text, describing that '%1' branch is checked out
source: Active branch: %1
ga: Brainse gníomhach: %1

source: Commit Changes
ga: Athruithe a Thiomnú

source: Commit
ga: Tiomantas

source: Cancel
ga: Cealaigh

source: Write commit message...
ga: Scríobh teachtaireacht tiomnaithe...

source: Extended commit description...
ga: Cur síos sínte ar an tiomantas...

source: Sign off
ga: Sínigh amach

source: Amend
ga: Leasaigh

source: Amend Last Commit
ga: Leasaigh an Tiomantas Deiridh

source: Amending Commit
ga: Tiomantas Leasaitheach

source: Staged
ga: Ar stáitse

source: Untracked
ga: Gan Rianú

source: Conflict
ga: Coimhlint

source: Modified
ga: Modhnaithe

source: Git Pull
ga: Tarraingt Git

source: Cancel Operation
ga: Cealaigh an Oibríocht

source: canceled.
ga: curtha ar ceal.

source: Refresh git status
ga: Athnuachan stádas git

source: Filter…
ga: Scagaire…

source: Failed to find .git directory for '%1', things may not work correctly
ga: Theip ar eolaire .git a aimsiú le haghaidh '%1', b'fhéidir nach n-oibreoidh rudaí i gceart

source: error: %1
ga: earráid: %1

source: "%1" executed successfully: %2
ga: "%1" curtha i gcrích go rathúil: %2

source: Failed to stage file. Error:
ga: Theip ar an gcomhad a chur ar stáitse. Earráid:

source: Failed to unstage file. Error:
ga: Theip ar an gcomhad a dhí-stáisiún. Earráid:

source: Failed to discard changes. Error:
ga: Theip ar athruithe a dhíscríobh. Earráid:

source: Failed to remove. Error:
ga: Theip ar bhaint. Earráid:

source: Failed to open file at HEAD: %1
ga: Theip ar chomhad a oscailt ag HEAD: %1

source: Failed to get Diff of file: %1
ga: Theip ar an difríocht den chomhad a fháil: %1

source: Failed to commit: %1
ga: Theip ar an tiomnú: %1

source: Changes committed successfully.
ga: Rinneadh na hathruithe go rathúil.

source: Nothing to commit. Please stage your changes first.
ga: Ní gá gealltanas a thabhairt. Déan do chuid athruithe a chur i bhfeidhm ar dtús, le do thoil.

source: Commit message cannot be empty.
ga: Ní féidir an teachtaireacht tiomantais a bheith folamh.

source: No diff for %1...%2
ga: Gan aon difríocht do %1...%2

source: Failed to compare %1...%2
ga: Theip ar %1...%2 a chur i gcomparáid

source: Failed to get numstat when diffing %1...%2
ga: Theip ar numstat a fháil agus difríocht %1...%2 á déanamh

source: Refresh
ga: Athnuachan

source: Checkout Branch
ga: Brainse Seiceála

source: Delete Branch
ga: Scrios Brainse

source: Compare Branch with...
ga: Déan comparáid idir Branch agus...

source: Show Commit
ga: Taispeáin Tiomantas

source: Show Last Commit
ga: Taispeáin an Tiomantas Deireanach

source: Open Commit...
ga: Oscail Tiomantas...

source: Stash
ga: Taisce

source: Show history
ga: Taispeáin stair

source: Diff - stash
ga: Difríocht - taisce

source: Pop Last Stash
ga: Pop an Taisce Deiridh

source: Pop Stash
ga: Stáis Pop

source: Apply Last Stash
ga: Cuir an Stoc Deireanach i bhFeidhm

source: Stash (Keep Staged)
ga: Taisce (Coinnigh ar an Stáitse)

source: Stash (Include Untracked)
ga: Stór (Cuir san áireamh Gan Rianú)

source: Apply Stash
ga: Cuir Taisce i bhFeidhm

source: Drop Stash
ga: Buail Taisce

source: Show Stash Content
ga: Taispeáin Ábhar an Stáisiúin

source: Stage All
ga: Céim Uile

source: Remove All
ga: Bain Gach Rud

source: Discard All
ga: Scrios Gach Rud

source: Open .gitignore
ga: Oscail .gitignore

source: Show Diff
ga: Taispeáin Difríocht

source: Are you sure you want to remove these files?
ga: An bhfuil tú cinnte gur mian leat na comhaid seo a bhaint?

source: Are you sure you want to discard all changes?
ga: An bhfuil tú cinnte gur mian leat na hathruithe go léir a chaitheamh amach?

source: Open File
ga: Oscail Comhad

source: Unstage File
ga: Comhad Dí-stáisiúin

source: Stage File
ga: Comhad Céime

source: Remove
ga: Bain

source: Discard
ga: Scrios

source: Show in External Git Diff Tool
ga: Taispeáin in Uirlis Sheachtrach Git Diff

source: Open at HEAD
ga: Oscail ag HEAD

source: Show History
ga: Taispeáin Stair

source: Are you sure you want to discard the changes in this file?
ga: An bhfuil tú cinnte gur mian leat na hathruithe sa chomhad seo a chaitheamh amach?

source: Are you sure you want to remove this file?
ga: An bhfuil tú cinnte gur mian leat an comhad seo a bhaint?

source: Unstage All
ga: Dí-stáblaigh Gach Rud

source: Unstage Selected Files
ga: Dí-stáisiú Comhaid Roghnaithe

source: Stage Selected Files
ga: Céim ar Chomhaid Roghnaithe

source: Discard Selected Files
ga: Scrios Comhaid Roghnaithe

source: Remove Selected Files
ga: Bain Comhaid Roghnaithe

source: Are you sure you want to discard the changes?
ga: An bhfuil tú cinnte gur mian leat na hathruithe a chaitheamh amach?

source: Are you sure you want to remove these untracked changes?
ga: An bhfuil tú cinnte gur mian leat na hathruithe neamhrianaithe seo a bhaint?

source: Malformed JSON file '%1': %2
ga: Comhad JSON mífhoirmithe '%1': %2

source: Project
ga: Tionscadal

source: <untracked>
ga: <gan rianú>

source: Project Completion
ga: Críochnú Tionscadail

# Groupbox title
source: Autoload Repositories && Build Trees
ga: Uathluchtaigh Stórais && Tóg Crainn

source: Project plugin is able to autoload repository working copies and build trees when there is no .kateproject file defined yet.
ga: Tá breiseán an tionscadail in ann cóipeanna oibre den stórlann a uathlódáil agus crainn a thógáil nuair nach bhfuil comhad .kateproject sainmhínithe fós.

source: &Subversion
ga: &Fo-iompar

# Groupbox title
source: Session Behavior
ga: Iompar Seisiúin

source: Session settings for projects
ga: Socruithe seisiúin do thionscadail

source: Restore Open Projects
ga: Athchóirigh Tionscadail Oscailte

# Groupbox title
source: Project Index
ga: Innéacs an Tionscadail

source: Project ctags index settings
ga: Socruithe innéacs ctags tionscadail

source: Enable indexing
ga: Cumasaigh innéacsú

source: Directory for index files
ga: Eolaire do chomhaid innéacs

source: The system temporary directory is used if not specified, which may overflow for very large repositories
ga: Úsáidtear an t-eolaire sealadach córais mura sonraítear é, rud a d'fhéadfadh ró-shreabhadh a dhéanamh i gcás stórtha an-mhóra

# Groupbox title
source: Cross-Project Functionality
ga: Feidhmiúlacht Tras-Thionscadail

source: Project plugin is able to perform some operations across multiple projects
ga: Tá an breiseán tionscadail in ann roinnt oibríochtaí a dhéanamh ar fud ilthionscadail

source: Cross-Project Completion
ga: Críochnú Tras-Thionscadail

source: Cross-Project Goto Symbol
ga: Siombail Gote Tras-Thionscadail

source: Single click action in the git status view
ga: Gníomh cliceáil aonair sa radharc stádais git

source: No Action
ga: Gan Ghníomh

source: Open file
ga: Oscail comhad

source: Stage / Unstage
ga: Stáitse / Gan stáitse

source: Double click action in the git status view
ga: Gníomh cliceáil faoi dhó sa radharc stádais git

source: Projects
ga: Tionscadail

# Groupbox title
source: Projects Properties
ga: Airíonna Tionscadal

# @title:tab
source: Terminal
ga: Teirminéal

# @title:tab
source: Terminal (Project)
ga: Teirminéal (Tionscadal)

# @title:tab
source: Terminal (Base)
ga: Teirminéal (Bonn)

# @title:tab
source: Terminal (Build)
ga: Teirminéal (Tógáil)

source: Code Index
ga: Innéacs an Chóid

source: Code Analysis
ga: Anailís Cód

source: Notes
ga: Nótaí

source: Start Analysis...
ga: Tosaigh Anailís...

# '%1' refers to project name, e.g,. Code Analysis - MyProject
source: Code Analysis - %1
ga: Anailís Chóid - %1

source: '%1' is not installed on your system, %2.<br/><br/>%3. The tool will be run on all project files which match this list of file extensions:<br/><b>%4</b>
ga: Níl '%1' suiteáilte ar do chóras, %2.<br/><br/>%3. Rithfear an uirlis ar gach comhad tionscadail a mheaitseálann an liosta síntí comhaid seo:<br/><b>%4</b>

source: Using %1 installed at: %2.<br/><br/>%3. The tool will be run on all project files which match this list of file extensions:<br/><b>%4</b>
ga: Ag baint úsáide as %1 suiteáilte ag: %2.<br/><br/>%3. Rithfear an uirlis ar gach comhad tionscadail a mheaitseálann an liosta síntí comhaid seo:<br/><b>%4</b>

source: CodeAnalysis
ga: Anailís Chóid

source: [%1]Analysis on %2 file finished.
ga: [%1]Anailís ar %2 comhad críochnaithe.

source: Analysis failed with exit code %1, Error: %2
ga: Theip ar an anailís le cód scoir %1, Earráid: %2

source: Name
ga: Ainm

source: Kind
ga: Cineál

source: File
ga: Comhad

source: Line
ga: Líne

source: Search
ga: Cuardaigh

source: The index could not be created. Please install 'ctags'.
ga: Níorbh fhéidir an t-innéacs a chruthú. Suiteáil 'ctags' le do thoil.

source: Indexing is not enabled
ga: Níl innéacsú cumasaithe

source: Error
ga: Earráid

source: File name already exists
ga: Tá ainm comhaid ann cheana féin

source: Confirm project closing: %1
ga: Deimhnigh dúnadh tionscadail: %1

source: Do you want to close the project %1 and the related %2 open documents?
ga: Ar mhaith leat an tionscadal %1 agus na %2 doiciméid oscailte gaolmhara a dhúnadh?

source: Full path to current project excluding the file name.
ga: Cosán iomlán chuig an tionscadal reatha gan ainm an chomhaid a áireamh.

source: Full path to current project excluding the file name, with native path separator (backslash on Windows).
ga: Cosán iomlán chuig an tionscadal reatha gan ainm an chomhaid a áireamh, le deighilteoir cosáin dúchasach (cúl-slais ar Windows).

source: Project Manager
ga: Bainisteoir Tionscadail

source: Open projects list
ga: Liosta tionscadal oscailte

source: Reload project
ga: Athlódáil an tionscadal

source: Close project
ga: Dún an tionscadal

source: Open &Folder...
ga: Oscail &Fillteán...

source: Project TODOs
ga: Tionscadail Na nObair Le Déanamh

source: Activate Previous Project
ga: Gníomhachtaigh an Tionscadal Roimhe Seo

source: Activate Next Project
ga: Gníomhachtaigh an Chéad Tionscadal Eile

source: Lookup
ga: Féach suas

source: Close All Projects
ga: Dún Gach Tionscadal

source: Close Orphaned Projects
ga: Dún Tionscadail Dílleachta

source: Reload Project
ga: Athlódáil an Tionscadal

source: Checkout Git Branch
ga: Brainse Git Seiceáil Amach

source: Lookup: %1
ga: Cuardach: %1

source: Goto: %1
ga: Téigh go: %1

source: Projects Index
ga: Innéacs na dTionscadal

source: Choose a directory
ga: Roghnaigh eolaire

source: Enter name:
ga: Cuir isteach ainm:

source: Do you want to delete the file '%1'?
ga: An bhfuil fonn ort an comhad '%1' a scriosadh?

source: Copy Location
ga: Cóipeáil Suíomh

source: New File…
ga: Comhad Nua…

source: New Folder…
ga: Fillteán Nua…

source: &Rename
ga: &Athainmnigh

source: Properties
ga: Airíonna

source: Open With
ga: Oscail Le

source: Open Internal Terminal Here
ga: Oscail an Teirminéal Inmheánach Anseo

source: Open External Terminal Here
ga: Oscail an Teirminéal Seachtrach Anseo

source: &Open Containing Folder
ga: &Oscail an Fillteán ina bhfuil

source: Show Git History
ga: Taispeáin Stair Git

source: New File
ga: Comhad Nua

source: Delete File
ga: Scrios Comhad

source: New Folder
ga: Fillteán Nua

source: The file already exists
ga: Tá an comhad ann cheana féin

source: Failed to create file: %1, Error: %2
ga: Theip ar chruthú comhaid: %1, Earráid: %2

source: The directory already exists
ga: Tá an t-eolaire ann cheana féin

source: Failed to create dir: %1
ga: Theip ar chruthú an eolaire: %1

source: Unable to find directory: %1
ga: Ní féidir an t-eolaire a aimsiú: %1

source: Unable to load %1 based project because either %1 is not installed or it wasn't found in PATH environment variable. Please install %1 or alternatively disable the option 'Autoload Repositories && Build Trees' in project settings.
ga: Ní féidir tionscadal bunaithe ar %1 a luchtú mar níl %1 suiteáilte nó níor aimsíodh é san athróg timpeallachta PATH. Suiteáil %1 nó díchumasaigh an rogha 'Autoload Repositories && Build Trees' i socruithe an tionscadail.

source: Execute a command in the active project's terminal.
ga: Cuir ordú i gcrích i dteirminéal an tionscadail ghníomhaigh.

source: No cmd provided
ga: Níor soláthraíodh cmd

source: Project Command
ga: Ordú Tionscadail

source: Stash message (optional). Enter to confirm, Esc to leave.
ga: Teachtaireacht stóráilte (roghnach). Iontráil le deimhniú, Esc le himeacht.

source: Type to filter, Enter to pop stash, Esc to leave.
ga: Clóscríobh le scagadh, Iontráil le stóráil a oscailt, Esc le himeacht.

source: Failed to stash changes %1
ga: Theip ar athruithe %1 a stóráil

source: Changes stashed successfully.
ga: Athruithe curtha i stóráil go rathúil.

source: Failed to get stash list. Error:
ga: Theip ar an liosta stórála a fháil. Earráid:

source: Failed to apply stash. Error:
ga: Theip ar an taisce a chur i bhfeidhm. Earráid:

source: Failed to drop stash. Error:
ga: Theip ar an taisce a scaoileadh. Earráid:

source: Failed to pop stash. Error:
ga: Theip ar an taisce a oscailt. Earráid:

source: Stash applied successfully.
ga: Cuireadh an stash i bhfeidhm go rathúil.

source: Stash dropped successfully.
ga: Scaoileadh an stash go rathúil.

source: Stash popped successfully.
ga: Phléasc Stash go rathúil.

source: Show stash failed. Error:
ga: Theip ar an taisce a thaispeáint. Earráid:

source: &Projects
ga: &Tionscadail
