Repository: Al-tronic/l10n-kde-ga
Catalog: messages/kate/kategdbplugin.po
Languages: ga

source: A debugging session is on course. Please, use re-run or stop the current session.
ga: Tá seisiún dífhabhtaithe ar siúl. Bain úsáid as athrith nó stop an seisiún reatha le do thoil.

source: Breakpoint
ga: Brisphointe

source: line %1 already has a breakpoint
ga: tá pointe briste ag líne %1 cheana féin

source: Add new target
ga: Cuir sprioc nua leis

source: Copy target
ga: Cóipeáil an sprioc

source: Delete target
ga: Scrios an sprioc

source: Reload launch.json targets
ga: Athlódáil spriocanna launch.json

source: Executable:
ga: Comhad inrite:

source: Working Directory:
ga: Comhadlann Oibre:

source: Process Id:
ga: Aitheantas Próisis:

# Program argument list
source: Arguments:
ga: Argóintí:

# Checkbox to for keeping focus on the command line
source: Keep focus
ga: Coinnigh an fócas

source: Keep the focus on the command line
ga: Coinnigh an fócas ar líne na n-orduithe

source: Redirect IO
ga: Atreoraigh I/A

source: Redirect the debugged programs IO to a separate tab
ga: Athdhírigh I/A an ríomhchláir dhífhabhtaithe ar chluaisín ar leith

# Error message
source: No executable target set
ga: Níl aon sprioc inrite socraithe

# Error message
source: Invalid process id
ga: Aitheantas próisis neamhbhailí

source: Target %1
ga: Sprioc %1

source: Select Executable
ga: Roghnaigh Inrite

source: Select Working Directory
ga: Roghnaigh Eolaire Oibre

source: DAP backend '%1' failed
ga: Theip ar chúl-deireadh DAP '%1'

source: program terminated
ga: clár críochnaithe

source: Failed to terminate. Forcing shutdown...
ga: Theip ar fhoirceannadh. Ag cur iallach ar dhúnadh...

source: requesting disconnection
ga: ag iarraidh dícheangal

source: requesting shutdown
ga: ag iarraidh múchadh

source: DAP backend: %1
ga: Cúltaca DAP: %1

source: stopped (%1).
ga: stoptha (%1).

source: Active thread: %1 (all threads stopped).
ga: Snáithe gníomhach: %1 (gach snáithe stoptha).

source: Active thread: %1.
ga: Snáithe gníomhach: %1.

source: Breakpoint(s) reached:
ga: Brisphointe(í) bainte amach:

source: (continued) thread %1
ga: (ar lean) snáithe %1

source: all threads continued
ga: leanadh leis na snáitheanna uile

source: (running)
ga: (ag rith)

source: *** connection with server closed ***
ga: *** nasc leis an bhfreastalaí dúnta ***

source: program exited with code %1
ga: scoir an clár le cód %1

source: *** waiting for user actions ***
ga: *** ag fanacht le gníomhartha úsáideora ***

source: error on response: %1
ga: earráid ar fhreagra: %1

source: important
ga: tábhachtach

source: telemetry
ga: teileamaitreacht

source: debugging process [%1] %2
ga: próiseas dífhabhtaithe [%1] %2

source: debugging process %1
ga: próiseas dífhabhtaithe %1

source: Start method: %1
ga: Modh tosaithe: %1

source: thread %1
ga: snáithe %1

source: breakpoint set
ga: socraithe brisphointe

source: (%1) breakpoint
ga: (%1) brisphointe

source: <not evaluated>
ga: <níor measúnaíodh>

source: server capabilities
ga: cumais freastalaí

source: supported
ga: tacaíocht

source: unsupported
ga: gan tacaíocht

source: conditional breakpoints
ga: pointí briste coinníollach

source: function breakpoints
ga: pointí briste feidhme

source: hit conditional breakpoints
ga: buaileann pointí briste coinníollach

source: log points
ga: pointí loga

source: modules request
ga: iarratas ar mhodúil

source: goto targets request
ga: iarratas spriocanna goto

source: terminate request
ga: deireadh a chur leis an iarratas

source: terminate debuggee
ga: deireadh a chur leis an dífhabhtóir

source: syntax error: expression not found
ga: earráid chomhréire: níor aimsíodh an abairt

source: syntax error: %1
ga: earráid chomhréire: %1

source: invalid line: %1
ga: líne neamhbhailí: %1

source: file not specified: %1
ga: comhad gan sonrú: %1

source: invalid thread id: %1
ga: aitheantas snáithe neamhbhailí: %1

source: thread id not specified: %1
ga: aitheantas snáithe gan sonrú: %1

source: Available commands:
ga: Orduithe atá ar fáil:

source: conditional breakpoints are not supported by the server
ga: ní thacaíonn an freastalaí le pointí briste coinníollacha

source: hit conditional breakpoints are not supported by the server
ga: ní thacaíonn an freastalaí le pointí briste coinníollach buailte

source: Current thread:
ga: Snáithe reatha:

source: none
ga: aon cheann

source: Current frame:
ga: Fráma reatha:

source: Session state:
ga: Stádas an tseisiúin:

source: initializing
ga: ag tosú

source: running
ga: ag rith

source: stopped
ga: stad

source: terminated
ga: foirceannta

source: disconnected
ga: dícheangailte

source: command not found
ga: níor aimsíodh an t-ordú

source: missing thread id
ga: aitheantas snáithe ar iarraidh

source: Current frame [%3]: %1:%2 (%4)
ga: Fráma reatha [%3]: %1:%2 (%4)

source: User Debug Adapter Settings
ga: Socruithe Cuibheora Dífhabhtaithe Úsáideora

source: Settings File:
ga: Comhad Socruithe:

source: Default Debug Adapter Settings
ga: Socruithe Réamhshocraithe an Oiriúnaitheora Dífhabhtaithe

source: Debugger
ga: Dífhabhtóir

source: No JSON data to validate.
ga: Gan aon sonraí JSON le bailíochtú.

source: JSON data is valid.
ga: Tá sonraí JSON bailí.

source: JSON data is invalid: no JSON object
ga: Tá sonraí JSON neamhbhailí: níl aon réad JSON ann

source: JSON data is invalid: %1
ga: Tá sonraí JSON neamhbhailí: %1

# %1 refers to filepath
source: Failed to parse .vscode/launch.json at %1.
ga: Theip ar pharsáil .vscode/launch.json ag %1.

# at line no:column no
source: at %1:%2
ga: ag %1:%2

source: type
ga: cineál

source: indexed items
ga: míreanna innéacsaithe

source: named items
ga: míreanna ainmnithe

source: Loading...
ga: Ag lódáil...

source: Symbol
ga: Siombail

source: Type
ga: Cineál

source: Value
ga: Luach

source: Copy Symbol
ga: Cóipeáil Siombail

source: Copy Value
ga: Cóipeáil Luach

source: Kate Debug
ga: Kate Dífhabhtú

source: Debug View
ga: Amharc Dífhabhtaithe

source: Debug
ga: Dílochtú

source: Locals and Stack
ga: Áitiúla agus Cruach

# @info
source: <title>Could not open file:</title><nl/>%1
ga: <title>Níorbh fhéidir an comhad a oscailt:</title><nl/>%1

source: Targets
ga: Spriocanna

source: Start Debugging
ga: Tosaigh Dífhabhtú

source: Kill / Stop Debugging
ga: Maraigh / Stop Dífhabhtú

source: Continue
ga: Lean ar aghaidh

source: Toggle Breakpoint / Break
ga: Scoránaigh Brisphointe / Briseadh

source: Clear All Breakpoints
ga: Glan Gach Brisphointe

source: Step In
ga: Céimnigh Isteach

source: Step Over
ga: Céimnigh Thart

source: Step Out
ga: Céimnigh Amach

source: Run To Cursor
ga: Rith go dtí an cúrsóir

source: Restart Debugging
ga: Atosaigh Dífhabhtú

source: Clear Output
ga: Aschur GDBAschur Glan

source: Hot Reload
ga: Athlódáil Te

source: Hot Restart
ga: Atosú Te

source: Enable Hot Reload on Save
ga: Cumasaigh Athlódáil Te ar Shábháil

# Move Program Counter (next execution)
source: Move PC
ga: Athraigh an PC

source: Print Value
ga: Priontáil Luach

source: Error: %1
ga: Earráid: %1

source: Insert breakpoint
ga: Ionsáigh brisphointe

source: Remove breakpoint
ga: Bain brisphointe

source: Execution point
ga: Pointe rite

# Tab label
source: Debug Output
ga: Aschur Dífhabhtaithe

# Tab label
source: Settings
ga: Socruithe

source: IO
ga: I/A

# Column label (frame number)
source: Nr
ga: Uimh

# Column label
source: Function
ga: Feidhm

# Column label
source: Location
ga: Suíomh

source: Thread %1
ga: Snáithe %1

source: Copy Stack Trace
ga: Cóipeáil Rian an Chruach

source: Open Location
ga: Oscail Suíomh

source: Copy Location
ga: Cóipeáil Suíomh

source: &Debug
ga: &Dífhabhtaigh

source: Debug Plugin
ga: Breiseán Dífhabhtaithe
