Repository: Al-tronic/l10n-kde-ga
Catalog: messages/khelpcenter/khelpcenter._desktop_.po
Languages: ga

# Name
source: Application Manuals
ga: Lámhleabhair Fheidhmchláir

# Name
source: Browse Info Pages
ga: Brabhsáil Leathanaigh Eolais

# Name
source: KInfoCenter Modules
ga: Modúil KInfoCenter

# Name
source: UNIX manual pages
ga: Leathanaigh lámhleabhair UNIX

# Name
source: (1) User Commands
ga: (1) Orduithe Úsáideora

# Name
source: (2) System Calls
ga: (2) Glaonna ar an chóras

# Name
source: (3) Subroutines
ga: (3) Foghnáthaimh

# Name
source: (4) Devices
ga: (4) Gléasra

# Name
source: (5) File Formats
ga: (5) Formáidí Comhaid

# Name
source: (6) Games
ga: (6) Cluichí

# Name
source: (7) Miscellaneous
ga: (7) Rudaí éagsúla

# Name
source: (8) Sys. Administration
ga: (8) Riarachán an Chórais

# Name
source: (9) Kernel
ga: (9) Eithne

# Name
source: (n) New
ga: (n) Nua

# Name
source: Online Help
ga: Cabhair Ar Líne

# Name
source: Plasma Manual
ga: Lámhleabhar Plasma
