Repository: Al-tronic/l10n-kde-ga
Catalog: messages/kgoldrunner/kgoldrunner._desktop_.po
Languages: ga

# GenericName
source: Hunt Gold, Dodge Enemies and Solve Puzzles
ga: Téigh sa Tóir ar Ór, Seachain Naimhde, agus Réitigh Puzail

# Comment
source: A game of action and puzzle-solving
ga: Cluiche gníomhaíochta agus réiteach puzal

# Name
source: Black on White
ga: Dubh ar Bhán

# Description
source: A monochrome, black on white theme for KGoldrunner
ga: Téama monacrómach, dubh ar bhán le haghaidh KGoldrunner

# Name
source: KGoldRunner Default
ga: Réamhshocrú KGoldrunner

# Description
source: A light and clean theme for KDE4
ga: Téama glan simplí le haghaidh KDE4

# Name
source: The Treasure of Egypt
ga: Saibhreas na hÉigipte

# Description
source: Help Matt Goldrunner escape the traps of ancient Egypt.
ga: Cuidigh le Matt Goldrunner teacht slán as gaistí na Sean-Éigipte.

# Description
source: The hero is trapped inside a computer.
ga: Tá an laoch gafa i ríomhaire.

# Description
source: A theme for KGoldrunner that brings back that 8-bit look... now in blue!
ga: Téama le haghaidh KGoldrunner a dhéanann athbheochan ar an gcuma 8-giotán... leagan gorm anois!

# Name
source: Nostalgia
ga: Cumha

# Description
source: A scalable theme for KGoldrunner that brings back that 8-bit look...
ga: Téama inscálaithe le haghaidh KGoldrunner a dhéanann athbheochan ar an gcuma 8-giotán...
