Repository: Al-tronic/l10n-kde-ga
Catalog: messages/palapeli/palapeli._desktop_.po
Languages: ga

# Name
source: Import into your Palapeli puzzle collection
ga: Iompórtáil isteach i do bhailiúchán puzal Palapeli

# Name
source: Castle of Maintenon
ga: Caisleán Mhaintenon

# Comment
source: Eure-et-Loir département, France
ga: Département Eure-et-Loir, An Fhrainc

# Name
source: Roebling Suspension Bridge
ga: Droichead Crochta Roebling

# Comment
source: in Cincinnati
ga: i Cincinnati

# Name
source: Citrus Fruits
ga: Torthaí Citris

# Name
source: European Honey Bee
ga: Beach Mheala Eorpach

# Comment
source: Female panther chameleon
ga: Banchaimileon pantair

# GenericName
source: Jigsaw puzzle game
ga: Cluiche míreanna mearaí

# Comment
source: Palapeli Jigsaw Puzzle
ga: Míreanna mearaí Palapeli

# Name
source: File management operations
ga: Oibríochtaí bainisteoireachta comhad

# Name
source: Importing puzzle
ga: Puzal á iompórtáil

# Comment
source: A puzzle is being imported into the local puzzle collection
ga: Puzal á iompórtáil isteach sa bhailiúchán logánta
