Repository: Al-tronic/l10n-kde-ga
Catalog: summit/messages/plasma-workspace/plasmashell.po
Languages: ga

# NAME OF TRANSLATORS
source: Your names
ga: Charlotte

# EMAIL OF TRANSLATORS
source: Your emails
ga: altronic25@protonmail.com

# @label %1 is the Plasma version
source: KDE Plasma 6.0 Alpha
ga: KDE Plasma 6.0 Alfa

# @action:button
source: Copy Plasma Version
ga: Cóipeáil Plasma Leagain

# @action:button
source: Report a Bug…
ga: Seol tuairisc ar fhabht...

# @title:menu
source: Hide Preview Banner
ga: Folaigh an Meirge Réamhamhairc

# @action:button Hide the preview banner until the system is restarted
source: Hide Until Restart
ga: Folaigh go dtí Atosaigh

# @action:button Hide the preview banner permanently
source: Hide Permanently…
ga: Folaigh go Buan...

# @title:window
source: Hide Preview Banner?
ga: An bhfuil tú Folaigh an Meirge Réamhamhairc?

source: Enter Edit Mode
ga: Cuir in Eagar Móid a Thosú

source: Exit Edit Mode
ga: Cuir in Eagar Mód a Stad

source: Plasma Shell
ga: Blaoisce Plasma

source: Load plasmashell as a standalone application, needs the shell-plugin option to be specified
ga: Lódáil Blaoisce Plasma mar feidhmchláir saorsheasaimh. Rogha shell-plugin a theastáil.

source: file
ga: comhad

source: Do not restart plasma-shell automatically after a crash
ga: Ní atosaigh go huathoibríoch blaoisce Plasma i ndiaidh tuairt

source: Plasma Failed To Start
ga: Níorbh Fhéidir Plasma a Thosú

source: Plasma is unable to start as it could not correctly use OpenGL 2 or software fallback Please check that your graphic drivers are set up correctly.
ga: Ní fhéidir Plasma a thosú mar gheall ar níorbh fhéidir OpenGL 2 nó rindreáil bogearraí a d'úsáid. Seiceáil go bhfuil do thiománaithe grafaice cumraithe i gceart le do thoil.

# OSD informing that the system is muted, keep short
source: Audio Muted
ga: Córas gan Fuaim

# OSD informing that the microphone is muted, keep short
source: Microphone Muted
ga: Micreafón Múchta

# OSD informing that some media app is muted, eg. Amarok Muted
source: %1 Muted
ga: %1 Gan Fuaim

# touchpad was enabled, keep short
source: Touchpad On
ga: Ceap Tadhaill Cumasaithe

# touchpad was disabled, keep short
source: Touchpad Off
ga: Ceap Tadhaill Múchta

# wireless lan was enabled, keep short
source: Wifi On
ga: Wifi Cumasaithe

# wireless lan was disabled, keep short
source: Wifi Off
ga: Wifi Múchta

# Bluetooth was enabled, keep short
source: Bluetooth On
ga: Bluetooth Cumasaithe

# Bluetooth was disabled, keep short
source: Bluetooth Off
ga: Bluetooth Múchta

# mobile internet was enabled, keep short
source: Mobile Internet On
ga: Idirlíon Mhóibíligh Cumasaithe

# mobile internet was disabled, keep short
source: Mobile Internet Off
ga: Idirlíon Mhóibíligh Múchta

source: On-Screen Keyboard Activated
ga: Méarchlár ar-Scáileán Cumasaithe

source: On-Screen Keyboard Deactivated
ga: Méarchlár ar-Scáileán Múchta

# power management was inhibited, keep short
source: Sleep and Screen Locking Blocked
ga: Codladh agus Glasáil Scáileáin Blocáilte

# power management was uninhibited, keep short
source: Sleep and Screen Locking Unblocked
ga: Codladh agus Glasáil Scáileáin Díbhlocáilte

# Power profile was changed to power save mode, keep short
source: Power Save Mode
ga: Cumhacht Sábhála Mód

# Power profile was changed to balanced mode, keep short
source: Balanced Power Mode
ga: Cumhacht Cothroime Mód

# Power profile was changed to performance mode, keep short
source: Performance Mode
ga: Feidhmíocht Mód

# Screen manufacturer and model on connector
source: %1 %2 on %3
ga: %1 %2 ar %3

source: Show Desktop
ga: Taispeáint Deasc

source: Hide Desktop
ga: Deasc a Fholaigh

source: Stop Current Activity
ga: Stad an Gníomh Reatha

# @action:button
source: Manage Desktops and Panels…
ga: Bainistigh Deasca agus Painéil...

source: Manage Desktops And Panels...
ga: Bainistigh Deasca Agus Painéil...

source: Add Panel
ga: Cuir Painéil Leis

# Creates an empty containment (%1 is the containment name)
source: Empty %1
ga: %1 Folamh

source: Software Renderer In Use
ga: Rindreáil Bogearraí á Úsáid

# Tooltip telling user their GL drivers are broken
source: Software Renderer In Use
ga: Rindreáil Bogearraí á Úsáid

source: Never show again
ga: Ná taispeáin go deo arís

source: Panel Count
ga: Méid Painéil

source: Counts the panels
ga: Comhair na painéil
