Repository: Al-tronic/l10n-kde-ga
Catalog: l10n-templates/trunk6/messages/ktorrent/ktorrent._desktop_.po
Languages: ga

# Name
source: Torrent silently opened
ga: Osclaíodh an torrent go ciúin

# Name
source: Torrent stopped by error
ga: Bhí an torrent ag earráid

# Name
source: Torrent has finished downloading
ga: Tá an t-íosluchtú críochnaithe

# Name
source: Maximum share ratio reached
ga: Sroicheadh cóimheas uasta comhroinnte

# Name
source: Maximum seed time reached
ga: Sroicheadh tréimhse uasta síolaithe

# Name
source: Disk space is running low
ga: Tá an diosca ag éirí lán

# Name
source: Corrupted data has been found
ga: Fuarthas sonraí truaillithe

# Name
source: Torrent cannot be enqueued
ga: Ní féidir an torrent a chur sa chiú

# Name
source: Torrent cannot be started
ga: Ní féidir an torrent a thosú

# Name
source: Torrent cannot be loaded silently
ga: Ní féidir an torrent a luchtú go ciúin

# Name
source: DHT is not enabled
ga: Níl DHT cumasaithe

# Name
source: Event generated by plugin
ga: Teagmhas cruthaithe ag breiseán

# Name
source: Magnet link download started
ga: Íosluchtú naisc maighnéid tosaithe

# GenericName
source: BitTorrent Client
ga: Cliant BitTorrent
