Repository: Al-tronic/l10n-kde-ga
Catalog: messages/kmahjongg/kmahjongg._desktop_.po
Languages: ga

# Name
source: 4 Winds
ga: Ceithre Ghaoth

# Description
source: A layout resembling a fortress
ga: Leagan amach cosúil le dún

# Name
source: Alien
ga: Eachtrán

# Description
source: A humanoid made up of Mahjongg tiles
ga: Daonóid déanta as tíleanna Mahjongg

# Name
source: Altar
ga: Altóir

# Name
source: Arena
ga: Airéine

# Name
source: Arrow
ga: Saighead

# Description
source: A big arrow pointing in the right direction
ga: Saighdead mhór dírithe ar dheis

# Name
source: Atlantis
ga: Atlantas

# Name
source: Aztec
ga: Aisticeach

# Description
source: A layout resembling Aztec buildings
ga: Leagan amach cosúil le foirgnimh Aisticeacha

# Name
source: Balance
ga: Cóimheá

# Name
source: Bat
ga: Ialtóg

# Description
source: A bat-shaped layout
ga: Leagan amach cosúil le hialtóg

# Name
source: Bug
ga: Feithid

# Name
source: Castle View
ga: Amharc Caisleáin

# Name
source: Castle
ga: Caisleán

# Name
source: Chains
ga: Slabhraí

# Name
source: Checkered
ga: Breac-chearnógach

# Name
source: Chip
ga: Slis

# Description
source: An electronic component with many connectors
ga: Comhpháirt leictreonach le neart nascóirí

# Name
source: Columns
ga: Colúin

# Name
source: Crab
ga: Portán

# Name
source: Cross
ga: Cros

# Name
source: Default
ga: Réamhshocrú

# Description
source: Default KMahjongg game layout
ga: Leagan amach réamhshocraithe le haghaidh KMahjongg

# Name
source: Dragon
ga: Dragan

# Name
source: Eagle
ga: Iolar

# Description
source: A layout for Star Trek fans
ga: Leagan amach le haghaidh leantóirí Star Trek

# Name
source: Explosion
ga: Pléasc

# Description
source: Something has exploded. Collect the pieces.
ga: Phléasc rud éigin. Bailigh na píosaí.

# Name
source: Flowers
ga: Bláthanna

# Description
source: A layout consisting of six flowers
ga: Leagan amach déanta as sé bhláth

# Name
source: Future
ga: Todhchaí

# Description
source: An abstract image resembling an asterisk
ga: Íomhá theibí cosúil le réiltín

# Name
source: Galaxy
ga: Réaltra

# Name
source: Garden
ga: Gairdín

# Description
source: Regular patterns resembling a classical garden
ga: Patrúin rialta cosúil le gairdín clasaiceach

# Name
source: Girl
ga: Cailín

# Description
source: A layout resembling a girl's face
ga: Leagan amach cosúil le cailín

# Name
source: Glade
ga: Plásóg Choille

# Name
source: Grid
ga: Greille

# Name
source: Hole
ga: Poll

# Description
source: A pyramid with a hole in the middle
ga: Pirimid le poll sa lár

# Name
source: Inner Circle
ga: Ciorcal Istigh

# Name
source: Key
ga: Eochair

# Description
source: A large key made of Mahjongg tiles
ga: Eochair mhór déanta as tíleanna Mahjongg

# Description
source: A complex yet symmetric labyrinth
ga: Lúbra atá casta ach siméadrach freisin

# Name
source: Mask
ga: Masc

# Name
source: Maya
ga: Máigeach

# Description
source: A layout resembling Maya pyramids
ga: Leagan amach cosúil le pirimidí Máigeacha

# Name
source: Maze
ga: Cathair Ghríobháin

# Name
source: Mesh
ga: Mogall

# Description
source: An interweaved structure made up of Mahjongg tiles
ga: Struchtúr fite, déanta as tíleanna Mahjongg

# Name
source: Moth
ga: Leamhan

# Description
source: A layout representing a small flying insect
ga: Leagan amach cosúil le feithid bheag eitilte

# Name
source: Order
ga: Ord

# Name
source: Pattern
ga: Patrún

# Name
source: Penta
ga: Peintea

# Description
source: A fortress with five towers
ga: Dún le cúig thúr

# Name
source: Pillars
ga: Piléir

# Name
source: Pirates
ga: Foghlaithe Mara

# Description
source: A sailing boat under the sun
ga: Bád seoil faoin ghrian

# Name
source: Pyramid
ga: Pirimid

# Description
source: Can you tear the pyramid apart?
ga: An bhfuil tú in ann an phirimid a sracadh as a chéile?

# Name
source: Rocket
ga: Roicéad

# Name
source: Shield
ga: Sciath

# Name
source: Spider
ga: Damhán Alla

# Name
source: Squares
ga: Cearnóga

# Name
source: Squaring
ga: Cearnú

# Description
source: A layout representing a football field
ga: Leagan amach cosúil le páirc pheile

# Name
source: Stairs
ga: Staighre

# Name
source: Star
ga: Réalta

# Description
source: An asterisk-shaped embossed layout
ga: Leagan amach bocóideach cosúil le réiltín

# Name
source: Star Ship
ga: Réaltlong

# Name
source: Stacks
ga: Cruacha

# Description
source: Difficult layout with stacks of tiles
ga: Leagan amach deacair le cruacha tíleanna

# Name
source: Swirl
ga: Guairneán

# Name
source: Temple
ga: Teampall

# Description
source: A temple-shaped layout
ga: Leagan amach cosúil le teampall

# Name
source: Theatre
ga: Amharclann

# Name
source: The Door
ga: An Doras

# Name
source: Time Tunnel
ga: Tollán Ama

# Name
source: Tomb
ga: Tuama

# Name
source: Totem
ga: Tótam

# Name
source: Tower
ga: Túr

# Description
source: Remove the towers
ga: Bain na túir

# Name
source: Triangle
ga: Triantán

# Description
source: Triangular pyramid
ga: Pirimid thriantánach

# Description
source: A V-shaped layout with thick lower corners
ga: Leagan amach i gcruth V, le cúinní tiubha íochtaracha

# Name
source: Well
ga: Tobar

# Name
source: X-shaped
ga: Cruth-X

# Description
source: A large letter X made of mahjongg tiles
ga: Litir mhór X déanta as tíleanna mahjongg

# GenericName
source: Mahjongg Solitaire
ga: Cluiche Aonair Mahjongg
