Repository: Al-tronic/l10n-kde-ga
Catalog: messages/kget/kget._desktop_.po
Languages: ga

# Name
source: Download with KGet
ga: Íosluchtaigh le KGet

# GenericName
source: Download Manager
ga: Bainisteoir Íosluchtaithe

# Comment
source: KGet is a versatile and user-friendly download manager
ga: Tá KGet ilghnéitheach agus so-úsáidte bainisteoir íosluchtaigh

# Comment
source: KGet Download Manager
ga: Bainisteoir Íosluchtaithe KGet

# Name
source: Transfer Added
ga: Cuireadh Aistriú Leis

# Comment
source: A new download has been added
ga: Cuireadh íosluchtú nua leis

# Name
source: Download Started
ga: Tosaíodh an tÍosluchtú

# Comment
source: Downloading started
ga: Tosaíodh an t-íosluchtú

# Name
source: Download Finished
ga: Críochnaíodh an tÍosluchtú

# Comment
source: Downloading finished
ga: Críochnaíodh an t-íosluchtú

# Name
source: All Downloads Finished
ga: Críochnaíodh Gach Íosluchtú

# Comment
source: All downloads finished
ga: Críochnaíodh gach íosluchtú

# Name
source: Error Occurred
ga: Tharla Earráid

# Comment
source: An Error has Occurred
ga: Tharla Earráid

# Name
source: Information
ga: Eolas

# Comment
source: User Notified of Information
ga: Cuireadh Eolas in Iúl don Úsáideoir
