Repository: Al-tronic/l10n-kde-ga
Catalog: l10n-templates/trunk6/messages/k3b/k3b._json_.po
Languages: ga

# Name
source: K3b FFMpeg Decoder
ga: Díchódóir FFMpeg K3b

# Name
source: K3b FLAC Decoder
ga: Díchódóir FLAC K3b

# Name
source: K3b Libsndfile Decoder
ga: Díchódóir Libsndfile K3b

# Name
source: K3b MAD Decoder
ga: Díchódóir MAD K3b

# Name
source: K3b Musepack Decoder
ga: Díchódóir Musepack K3b

# Name
source: K3b Ogg Vorbis Decoder
ga: Díchódóir Ogg Vorbis K3b

# Name
source: K3b ??? Decoder
ga: Díchódóir ??? K3b

# Name
source: K3b Wave Decoder
ga: Díchódóir Wave K3b

# Name
source: K3b External Audio Encoder
ga: Ionchódóir Seachtrach Fuaime K3b

# Name
source: K3b Ogg Vorbis Encoder
ga: Ionchódóir Ogg Vorbis K3b

# Name
source: K3b ??? Encoder
ga: Ionchódóir ??? K3b

# Name
source: K3b SoX Audio Encoder
ga: Ionchódóir SoX K3b

# Name
source: K3b Audio Metainfo Renamer
ga: Athainmneoir Meiteafhaisnéise Fuaime K3b

# Description
source: Decoding module to decode FLAC files
ga: Modúl díchódaithe a dhíchódaíonn comhaid FLAC

# Description
source: Decoding module to decode audio files supported by libsndfile
ga: Modúl díchódaithe a dhíchódaíonn comhaid fhuaime a dtacaíonn libsndfile leo

# Description
source: Decoding module to decode MPEG 1 Layer III files
ga: Modúl díchódaithe a dhíchódaíonn comhaid MPEG 1 Sraith III

# Description
source: Decoding module to decode Musepack audio files
ga: Modúl díchódaithe a dhíchódaíonn comhaid Musepack

# Description
source: Decoding module to decode Ogg Vorbis files
ga: Modúl díchódaithe a dhíchódaíonn comhaid Ogg Vorbis

# Description
source: Decoding module to decode ??? files
ga: Modúl díchódaithe a dhíchódaíonn comhaid ???

# Description
source: Decoding module to decode wave files
ga: Modúl díchódaithe a dhíchódaíonn comhaid Wave

# Description
source: Encoding module that allows specifying an encoding command
ga: Modúl ionchódaithe a cheadaíonn duit ordú ionchódaithe a roghnú

# Description
source: Encoding module to encode Ogg Vorbis files
ga: Modúl ionchódaithe a ionchódaíonn comhaid Ogg Vorbis

# Description
source: Encoding module to encode <name> files
ga: Modúl ionchódaithe a ionchódaíonn comhaid <name>

# Description
source: Encoding module to encode many file formats using SoX
ga: Modúl ionchódaithe a ionchódaíonn a lán formáidí comhaid le SoX

# Description
source: Plugin to rename audio files in a data project based on the meta info.
ga: Breiseán a athainmníonn comhaid fhuaime i dtionscadal sonraí, bunaithe ar an mheiteafhaisnéis.
