Repository: Al-tronic/l10n-kde-ga
Catalog: messages/krfb/krfb._desktop_.po
Languages: ga

# Comment
source: Desktop Sharing
ga: Roinnt Deisce

# Name
source: User Accepts Connection
ga: Glacann an tÚsáideoir Le Ceangal

# Comment
source: User accepts connection
ga: Glacann úsáideoir le ceangal

# Name
source: User Refuses Connection
ga: Diúltaíonn an tÚsáideoir Le Ceangal

# Comment
source: User refuses connection
ga: Diúltaíonn úsáideoir ceangal

# Name
source: Connection Closed
ga: Ceangal Dúnta

# Comment
source: Connection closed
ga: Ceangal dúnta

# Name
source: Invalid Password
ga: Focal Faire Neamhbhailí

# Comment
source: Invalid password
ga: Focal faire neamhbhailí

# Name
source: Invalid Password Invitations
ga: Cuirí Neamhbhailí Focal Faire

# Comment
source: The invited party sent an invalid password. Connection refused.
ga: Sheol an duine le cuireadh focal faire neamhbhailí. Diúltaíodh an ceangal.

# Name
source: New Connection on Hold
ga: Ceangal Nua Ag Fanacht

# Comment
source: Connection requested, user must accept
ga: Ceangal iarrtha; ní mór don úsáideoir glacadh leis

# Name
source: New Connection Auto Accepted
ga: Ceangal nua bunaithe go huathoibríoch

# Comment
source: New connection automatically established
ga: Ceangal nua bunaithe go huathoibríoch

# Name
source: Too Many Connections
ga: An Iomarca Ceangal

# Comment
source: Busy, connection refused
ga: Gnóthach; ceangal diúltaithe

# Name
source: Unexpected Connection
ga: Ceangal Gan Choinne

# Comment
source: Received unexpected connection, abort
ga: Fuarthas ceangal gan choinne, á thobscor
